Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_otg_hs.
; =================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_otg_hs equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// OTG_HS address definitions
// --------------------------

typedef struct {
    volatile    uint32_t    GOTGCTL;
    volatile    uint32_t    GOTGINT;
    volatile    uint32_t    GAHBCFG;
    volatile    uint32_t    GUSBCFG;
    volatile    uint32_t    GRSTCTL;
    volatile    uint32_t    GINTSTS;
    volatile    uint32_t    GINTMSK;
    volatile    uint32_t    GRXSTSR;
    volatile    uint32_t    GRXSTSP;
    volatile    uint32_t    GRXFSIZ;
    volatile    uint32_t    HNPTXFSIZ;
    volatile    uint32_t    HNPTXSTS;
    volatile    uint32_t    RESERVED0[2];
    volatile    uint32_t    GCCFG;
    volatile    uint32_t    CID;
    volatile    uint32_t    RESERVED1[5];
    volatile    uint32_t    GLPMCFG;
    volatile    uint32_t    RESERVED2[42];
    volatile    uint32_t    HPTXFSIZ;
    volatile    uint32_t    DIEPTXF1;
    volatile    uint32_t    DIEPTXF2;
    volatile    uint32_t    DIEPTXF3;
    volatile    uint32_t    DIEPTXF4;
    volatile    uint32_t    DIEPTXF5;
    volatile    uint32_t    DIEPTXF6;
    volatile    uint32_t    DIEPTXF7;
    volatile    uint32_t    DIEPTXF8;
    volatile    uint32_t    RESERVED3[183];
    volatile    uint32_t    HCFG;
    volatile    uint32_t    HFIR;
    volatile    uint32_t    HFNUM;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    HPTXSTS;
    volatile    uint32_t    HAINT;
    volatile    uint32_t    HAINTMSK;
    volatile    uint32_t    RESERVED5[9];
    volatile    uint32_t    HPRT;
    volatile    uint32_t    RESERVED6[47];
    volatile    uint32_t    HCCHAR0;
    volatile    uint32_t    HCSPLT0;
    volatile    uint32_t    HCINT0;
    volatile    uint32_t    HCINTMSK0;
    volatile    uint32_t    HCTSIZ0;
    volatile    uint32_t    HCDMA0;
    volatile    uint32_t    RESERVED7[2];
    volatile    uint32_t    HCCHAR1;
    volatile    uint32_t    HCSPLT1;
    volatile    uint32_t    HCINT1_DEVICE;
    volatile    uint32_t    HCINTMSK1;
    volatile    uint32_t    HCTSIZ1;
    volatile    uint32_t    HCDMA1;
    volatile    uint32_t    RESERVED8[2];
    volatile    uint32_t    HCCHAR2;
    volatile    uint32_t    HCSPLT2;
    volatile    uint32_t    HCINT2;
    volatile    uint32_t    HCINTMSK2;
    volatile    uint32_t    HCTSIZ2;
    volatile    uint32_t    HCDMA2;
    volatile    uint32_t    RESERVED9[2];
    volatile    uint32_t    HCCHAR3;
    volatile    uint32_t    HCSPLT3;
    volatile    uint32_t    HCINT3;
    volatile    uint32_t    HCINTMSK3;
    volatile    uint32_t    HCTSIZ3;
    volatile    uint32_t    HCDMA3;
    volatile    uint32_t    RESERVED10[2];
    volatile    uint32_t    HCCHAR4;
    volatile    uint32_t    HCSPLT4;
    volatile    uint32_t    HCINT4;
    volatile    uint32_t    HCINTMSK4;
    volatile    uint32_t    HCTSIZ4;
    volatile    uint32_t    HCDMA4;
    volatile    uint32_t    RESERVED11[2];
    volatile    uint32_t    HCCHAR5;
    volatile    uint32_t    HCSPLT5;
    volatile    uint32_t    HCINT5;
    volatile    uint32_t    HCINTMSK5;
    volatile    uint32_t    HCTSIZ5;
    volatile    uint32_t    HCDMA5;
    volatile    uint32_t    RESERVED12[2];
    volatile    uint32_t    HCCHAR6;
    volatile    uint32_t    HCSPLT6;
    volatile    uint32_t    HCINT6;
    volatile    uint32_t    HCINTMSK6;
    volatile    uint32_t    HCTSIZ6;
    volatile    uint32_t    HCDMA6;
    volatile    uint32_t    RESERVED13[2];
    volatile    uint32_t    HCCHAR7;
    volatile    uint32_t    HCSPLT7;
    volatile    uint32_t    HCINT7;
    volatile    uint32_t    HCINTMSK7;
    volatile    uint32_t    HCTSIZ7;
    volatile    uint32_t    HCDMA7;
    volatile    uint32_t    RESERVED14[2];
    volatile    uint32_t    HCCHAR8;
    volatile    uint32_t    HCSPLT8;
    volatile    uint32_t    HCINT8;
    volatile    uint32_t    HCINTMSK8;
    volatile    uint32_t    HCTSIZ8;
    volatile    uint32_t    HCDMA8;
    volatile    uint32_t    RESERVED15[2];
    volatile    uint32_t    HCCHAR9;
    volatile    uint32_t    HCSPLT9;
    volatile    uint32_t    HCINT9;
    volatile    uint32_t    HCINTMSK9;
    volatile    uint32_t    HCTSIZ9;
    volatile    uint32_t    HCDMA9;
    volatile    uint32_t    RESERVED16[2];
    volatile    uint32_t    HCCHAR10;
    volatile    uint32_t    HCSPLT10;
    volatile    uint32_t    HCINT10;
    volatile    uint32_t    HCINTMSK10;
    volatile    uint32_t    HCTSIZ10;
    volatile    uint32_t    HCDMA10;
    volatile    uint32_t    RESERVED17[2];
    volatile    uint32_t    HCCHAR11;
    volatile    uint32_t    HCSPLT11;
    volatile    uint32_t    HCINT11;
    volatile    uint32_t    HCINTMSK11;
    volatile    uint32_t    HCTSIZ11;
    volatile    uint32_t    HCDMA11;
    volatile    uint32_t    RESERVED18[2];
    volatile    uint32_t    HCCHAR12;
    volatile    uint32_t    HCSPLT12;
    volatile    uint32_t    HCINT12;
    volatile    uint32_t    HCINTMSK12;
    volatile    uint32_t    HCTSIZ12;
    volatile    uint32_t    HCDMA12;
    volatile    uint32_t    RESERVED19[2];
    volatile    uint32_t    HCCHAR13;
    volatile    uint32_t    HCSPLT13;
    volatile    uint32_t    HCINT13;
    volatile    uint32_t    HCINTMSK13;
    volatile    uint32_t    HCTSIZ13;
    volatile    uint32_t    HCDMA13;
    volatile    uint32_t    RESERVED20[2];
    volatile    uint32_t    HCCHAR14;
    volatile    uint32_t    HCSPLT14;
    volatile    uint32_t    HCINT14;
    volatile    uint32_t    HCINTMSK14;
    volatile    uint32_t    HCTSIZ14;
    volatile    uint32_t    HCDMA14;
    volatile    uint32_t    RESERVED21[2];
    volatile    uint32_t    HCCHAR15;
    volatile    uint32_t    HCSPLT15;
    volatile    uint32_t    HCINT15;
    volatile    uint32_t    HCINTMSK15;
    volatile    uint32_t    HCTSIZ15;
    volatile    uint32_t    HCDMA15;
    volatile    uint32_t    RESERVED22[66];
    volatile    uint32_t    DCFG;
    volatile    uint32_t    DCTL;
    volatile    uint32_t    DSTS;
    volatile    uint32_t    RESERVED23;
    volatile    uint32_t    DIEPMSK;
    volatile    uint32_t    DOEPMSK;
    volatile    uint32_t    DAINT;
    volatile    uint32_t    DAINTMSK;
    volatile    uint32_t    RESERVED24[2];
    volatile    uint32_t    DVBUSDIS;
    volatile    uint32_t    DVBUSPULSE;
    volatile    uint32_t    DTHRCTL;
    volatile    uint32_t    DIEPEMPMSK;
    volatile    uint32_t    RESERVED25[19];
    volatile    uint32_t    DOEPEACHMSK1;
    volatile    uint32_t    RESERVED26[30];
    volatile    uint32_t    DIEPCTL0;
    volatile    uint32_t    RESERVED27;
    volatile    uint32_t    DIEPINT0;
    volatile    uint32_t    RESERVED28;
    volatile    uint32_t    DIEPTSIZ0;
    volatile    uint32_t    RESERVED29;
    volatile    uint32_t    DTXFSTS0;
    volatile    uint32_t    RESERVED30;
    volatile    uint32_t    DIEPCTL1;
    volatile    uint32_t    RESERVED31;
    volatile    uint32_t    DIEPINT1;
    volatile    uint32_t    RESERVED32;
    volatile    uint32_t    DIEPTSIZ1;
    volatile    uint32_t    DIEPDMA1;
    volatile    uint32_t    DTXFSTS1;
    volatile    uint32_t    RESERVED33;
    volatile    uint32_t    DIEPCTL2;
    volatile    uint32_t    RESERVED34;
    volatile    uint32_t    DIEPINT2;
    volatile    uint32_t    RESERVED35;
    volatile    uint32_t    DIEPTSIZ2;
    volatile    uint32_t    DIEPDMA2;
    volatile    uint32_t    DTXFSTS2;
    volatile    uint32_t    RESERVED36;
    volatile    uint32_t    DIEPCTL3;
    volatile    uint32_t    RESERVED37;
    volatile    uint32_t    DIEPINT3;
    volatile    uint32_t    RESERVED38;
    volatile    uint32_t    DIEPTSIZ3;
    volatile    uint32_t    DIEPDMA3;
    volatile    uint32_t    DTXFSTS3;
    volatile    uint32_t    RESERVED39;
    volatile    uint32_t    DIEPCTL4;
    volatile    uint32_t    RESERVED40;
    volatile    uint32_t    DIEPINT4;
    volatile    uint32_t    RESERVED41;
    volatile    uint32_t    DIEPTSIZ4;
    volatile    uint32_t    DIEPDMA4;
    volatile    uint32_t    DTXFSTS4;
    volatile    uint32_t    RESERVED42;
    volatile    uint32_t    DIEPCTL5;
    volatile    uint32_t    RESERVED43;
    volatile    uint32_t    DIEPINT5;
    volatile    uint32_t    RESERVED44;
    volatile    uint32_t    DIEPTSIZ5;
    volatile    uint32_t    DIEPDMA5;
    volatile    uint32_t    DTXFSTS5;
    volatile    uint32_t    RESERVED45[3];
    volatile    uint32_t    DIEPINT6;
    volatile    uint32_t    RESERVED46;
    volatile    uint32_t    DIEPTSIZ6;
    volatile    uint32_t    DIEPDMA6;
    volatile    uint32_t    RESERVED47[4];
    volatile    uint32_t    DIEPINT7;
    volatile    uint32_t    RESERVED48;
    volatile    uint32_t    DIEPTSIZ7;
    volatile    uint32_t    DIEPDMA7;
    volatile    uint32_t    RESERVED49[4];
    volatile    uint32_t    DIEPINT8;
    volatile    uint32_t    RESERVED50;
    volatile    uint32_t    DIEPTSIZ8;
    volatile    uint32_t    DIEPDMA8;
    volatile    uint32_t    RESERVED51[58];
    volatile    uint32_t    DOEPCTL0;
    volatile    uint32_t    RESERVED52;
    volatile    uint32_t    DOEPINT0;
    volatile    uint32_t    RESERVED53;
    volatile    uint32_t    DOEPTSIZ0;
    volatile    uint32_t    DOEPDMA0;
    volatile    uint32_t    RESERVED54[2];
    volatile    uint32_t    DOEPCTL1;
    volatile    uint32_t    RESERVED55;
    volatile    uint32_t    DOEPINT1;
    volatile    uint32_t    RESERVED56;
    volatile    uint32_t    DOEPTSIZ1;
    volatile    uint32_t    DOEPDMA1;
    volatile    uint32_t    RESERVED57[2];
    volatile    uint32_t    DOEPCTL2;
    volatile    uint32_t    RESERVED58;
    volatile    uint32_t    DOEPINT2;
    volatile    uint32_t    RESERVED59;
    volatile    uint32_t    DOEPTSIZ2;
    volatile    uint32_t    DOEPDMA2;
    volatile    uint32_t    RESERVED60[2];
    volatile    uint32_t    DOEPCTL3;
    volatile    uint32_t    RESERVED61;
    volatile    uint32_t    DOEPINT3;
    volatile    uint32_t    RESERVED62;
    volatile    uint32_t    DOEPTSIZ3;
    volatile    uint32_t    DOEPDMA3;
    volatile    uint32_t    RESERVED63[2];
    volatile    uint32_t    DOEPCTL4;
    volatile    uint32_t    RESERVED64;
    volatile    uint32_t    DOEPINT4;
    volatile    uint32_t    RESERVED65;
    volatile    uint32_t    DOEPTSIZ4;
    volatile    uint32_t    DOEPDMA4;
    volatile    uint32_t    RESERVED66[2];
    volatile    uint32_t    DOEPCTL5;
    volatile    uint32_t    RESERVED67;
    volatile    uint32_t    DOEPINT5;
    volatile    uint32_t    RESERVED68;
    volatile    uint32_t    DOEPTSIZ5;
    volatile    uint32_t    DOEPDMA5;
    volatile    uint32_t    RESERVED69[2];
    volatile    uint32_t    DOEPCTL6;
    volatile    uint32_t    RESERVED70;
    volatile    uint32_t    DOEPINT6;
    volatile    uint32_t    RESERVED71;
    volatile    uint32_t    DOEPTSIZ6;
    volatile    uint32_t    DOEPDMA6;
    volatile    uint32_t    RESERVED72[2];
    volatile    uint32_t    DOEPCTL7;
    volatile    uint32_t    RESERVED73;
    volatile    uint32_t    DOEPINT7;
    volatile    uint32_t    RESERVED74;
    volatile    uint32_t    DOEPTSIZ7;
    volatile    uint32_t    DOEPDMA7;
    volatile    uint32_t    RESERVED75[2];
    volatile    uint32_t    DOEPCTL8;
    volatile    uint32_t    RESERVED76;
    volatile    uint32_t    DOEPINT8;
    volatile    uint32_t    RESERVED77;
    volatile    uint32_t    DOEPTSIZ8;
    volatile    uint32_t    DOEPDMA8;
    volatile    uint32_t    RESERVED78[122];
    volatile    uint32_t    PCGCCTL;
} OTG_HS_TypeDef;

#ifdef __cplusplus
#define OTG_HS_NS   reinterpret_cast<OTG_HS_TypeDef *>(0x42040000U)
#define OTG_HS_S    reinterpret_cast<OTG_HS_TypeDef *>(0x52040000U)

#else
#define OTG_HS_NS   ((OTG_HS_TypeDef *)0x42040000U)
#define OTG_HS_S    ((OTG_HS_TypeDef *)0x52040000U)
#endif

