Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
// GOTGCTL Configuration

#define OTG_HS_GOTGCTL_CURMOD               (0x1U<<21)
#define OTG_HS_GOTGCTL_OTGVER               (0x1U<<20)
#define OTG_HS_GOTGCTL_BSVLD                (0x1U<<19)
#define OTG_HS_GOTGCTL_ASVLD                (0x1U<<18)
#define OTG_HS_GOTGCTL_DBCT                 (0x1U<<17)
#define OTG_HS_GOTGCTL_CIDSTS               (0x1U<<16)
#define OTG_HS_GOTGCTL_EHEN                 (0x1U<<12)
#define OTG_HS_GOTGCTL_DHNPEN               (0x1U<<11)
#define OTG_HS_GOTGCTL_HSHNPEN              (0x1U<<10)
#define OTG_HS_GOTGCTL_HNPRQ                (0x1U<<9)
#define OTG_HS_GOTGCTL_HNGSCS               (0x1U<<8)
#define OTG_HS_GOTGCTL_BVALOVAL             (0x1U<<7)
#define OTG_HS_GOTGCTL_BVALOEN              (0x1U<<6)
#define OTG_HS_GOTGCTL_AVALOVAL             (0x1U<<5)
#define OTG_HS_GOTGCTL_AVALOEN              (0x1U<<4)
#define OTG_HS_GOTGCTL_VBVALOVAL            (0x1U<<3)
#define OTG_HS_GOTGCTL_VBVALOEN             (0x1U<<2)
#define OTG_HS_GOTGCTL_SRQ                  (0x1U<<1)
#define OTG_HS_GOTGCTL_SRQSCS               (0x1U<<0)

// GOTGINT Configuration

#define OTG_HS_GOTGINT_DBCDNE               (0x1U<<19)
#define OTG_HS_GOTGINT_ADTOCHG              (0x1U<<18)
#define OTG_HS_GOTGINT_HNGDET               (0x1U<<17)
#define OTG_HS_GOTGINT_HNSSCHG              (0x1U<<9)
#define OTG_HS_GOTGINT_SRSSCHG              (0x1U<<8)
#define OTG_HS_GOTGINT_SEDET                (0x1U<<2)

// GAHBCFG Configuration

#define OTG_HS_GAHBCFG_PTXFELVL             (0x1U<<8)
#define OTG_HS_GAHBCFG_TXFELVL              (0x1U<<7)
#define OTG_HS_GAHBCFG_GINTMSK              (0x1U<<0)

// GUSBCFG Configuration

#define OTG_HS_GUSBCFG_FDMOD                (0x1U<<30)
#define OTG_HS_GUSBCFG_FHMOD                (0x1U<<29)
#define OTG_HS_GUSBCFG_TSDPS                (0x1U<<22)
#define OTG_HS_GUSBCFG_PHYLPC               (0x1U<<15)
#define OTG_HS_GUSBCFG_TRDT                 (0xFU<<10)
#define OTG_HS_GUSBCFG_TRDT_0               (0x1U<<10)
#define OTG_HS_GUSBCFG_HNPCAP               (0x1U<<9)
#define OTG_HS_GUSBCFG_SRPCAP               (0x1U<<8)
#define OTG_HS_GUSBCFG_PHYSEL               (0x1U<<6)
#define OTG_HS_GUSBCFG_TOCAL                (0x7U<<0)
#define OTG_HS_GUSBCFG_TOCAL_0              (0x1U<<0)

// GRSTCTL Configuration

#define OTG_HS_GRSTCTL_AHBIDL               (0x1U<<31)
#define OTG_HS_GRSTCTL_DMAREQ               (0x1U<<30)
#define OTG_HS_GRSTCTL_TXFNUM               (0x1FU<<6)
#define OTG_HS_GRSTCTL_TXFNUM_0             (0x1U<<6)
#define OTG_HS_GRSTCTL_TXFFLSH              (0x1U<<5)
#define OTG_HS_GRSTCTL_RXFFLSH              (0x1U<<4)
#define OTG_HS_GRSTCTL_FSRST                (0x1U<<2)
#define OTG_HS_GRSTCTL_PSRST                (0x1U<<1)
#define OTG_HS_GRSTCTL_CSRST                (0x1U<<0)

// GINTSTS Configuration

#define OTG_HS_GINTSTS_WKUPINT              (0x1U<<31)
#define OTG_HS_GINTSTS_SRQINT               (0x1U<<30)
#define OTG_HS_GINTSTS_DISCINT              (0x1U<<29)
#define OTG_HS_GINTSTS_CIDSCHG              (0x1U<<28)
#define OTG_HS_GINTSTS_LPMINT               (0x1U<<27)
#define OTG_HS_GINTSTS_PTXFE                (0x1U<<26)
#define OTG_HS_GINTSTS_HCINT                (0x1U<<25)
#define OTG_HS_GINTSTS_HPRTINT              (0x1U<<24)
#define OTG_HS_GINTSTS_RSTDET               (0x1U<<23)
#define OTG_HS_GINTSTS_DATAFSUSP            (0x1U<<22)
#define OTG_HS_GINTSTS_IPXFR                (0x1U<<21)
#define OTG_HS_GINTSTS_IISOIXFR             (0x1U<<20)
#define OTG_HS_GINTSTS_OEPINT               (0x1U<<19)
#define OTG_HS_GINTSTS_IEPINT               (0x1U<<18)
#define OTG_HS_GINTSTS_EOPF                 (0x1U<<15)
#define OTG_HS_GINTSTS_ISOODRP              (0x1U<<14)
#define OTG_HS_GINTSTS_ENUMDNE              (0x1U<<13)
#define OTG_HS_GINTSTS_USBRST               (0x1U<<12)
#define OTG_HS_GINTSTS_USBSUSP              (0x1U<<11)
#define OTG_HS_GINTSTS_ESUSP                (0x1U<<10)
#define OTG_HS_GINTSTS_GONAKEFF             (0x1U<<7)
#define OTG_HS_GINTSTS_GINAKEFF             (0x1U<<6)
#define OTG_HS_GINTSTS_NPTXFE               (0x1U<<5)
#define OTG_HS_GINTSTS_RXFLVL               (0x1U<<4)
#define OTG_HS_GINTSTS_SOF                  (0x1U<<3)
#define OTG_HS_GINTSTS_OTGINT               (0x1U<<2)
#define OTG_HS_GINTSTS_MMIS                 (0x1U<<1)
#define OTG_HS_GINTSTS_CMOD                 (0x1U<<0)

// GINTMSK Configuration

#define OTG_HS_GINTMSK_WUIM                 (0x1U<<31)
#define OTG_HS_GINTMSK_SRQIM                (0x1U<<30)
#define OTG_HS_GINTMSK_DISCINT              (0x1U<<29)
#define OTG_HS_GINTMSK_CIDSCHGM             (0x1U<<28)
#define OTG_HS_GINTMSK_LPMINTM              (0x1U<<27)
#define OTG_HS_GINTMSK_PTXFEM               (0x1U<<26)
#define OTG_HS_GINTMSK_HCIM                 (0x1U<<25)
#define OTG_HS_GINTMSK_PRTIM                (0x1U<<24)
#define OTG_HS_GINTMSK_RSTDETM              (0x1U<<23)
#define OTG_HS_GINTMSK_FSUSPM               (0x1U<<22)
#define OTG_HS_GINTMSK_IPXFRM               (0x1U<<21)
#define OTG_HS_GINTMSK_IISOIXFRM            (0x1U<<20)
#define OTG_HS_GINTMSK_OEPINT               (0x1U<<19)
#define OTG_HS_GINTMSK_IEPINT               (0x1U<<18)
#define OTG_HS_GINTMSK_EOPFM                (0x1U<<15)
#define OTG_HS_GINTMSK_ISOODRPM             (0x1U<<14)
#define OTG_HS_GINTMSK_ENUMDNEM             (0x1U<<13)
#define OTG_HS_GINTMSK_USBRST               (0x1U<<12)
#define OTG_HS_GINTMSK_USBSUSPM             (0x1U<<11)
#define OTG_HS_GINTMSK_ESUSPM               (0x1U<<10)
#define OTG_HS_GINTMSK_GONAKEFFM            (0x1U<<7)
#define OTG_HS_GINTMSK_GINAKEFFM            (0x1U<<6)
#define OTG_HS_GINTMSK_NPTXFEM              (0x1U<<5)
#define OTG_HS_GINTMSK_RXFLVLM              (0x1U<<4)
#define OTG_HS_GINTMSK_SOFM                 (0x1U<<3)
#define OTG_HS_GINTMSK_OTGINT               (0x1U<<2)
#define OTG_HS_GINTMSK_MMISM                (0x1U<<1)

// GRXSTSR Configuration

#define OTG_HS_GRXSTSR_STSPHST              (0x1U<<27)
#define OTG_HS_GRXSTSR_FRMNUM               (0xFU<<21)
#define OTG_HS_GRXSTSR_FRMNUM_0             (0x1U<<21)
#define OTG_HS_GRXSTSR_PKTSTS               (0xFU<<17)
#define OTG_HS_GRXSTSR_PKTSTS_0             (0x1U<<17)
#define OTG_HS_GRXSTSR_DPID                 (0x3U<<15)
#define OTG_HS_GRXSTSR_DPID_0               (0x1U<<15)
#define OTG_HS_GRXSTSR_BCNT                 (0x7FFU<<4)
#define OTG_HS_GRXSTSR_BCNT_0               (0x1U<<4)
#define OTG_HS_GRXSTSR_EPNUM                (0xFU<<0)
#define OTG_HS_GRXSTSR_EPNUM_0              (0x1U<<0)

// GRXSTSP Configuration

#define OTG_HS_GRXSTSP_STSPHST              (0x1U<<27)
#define OTG_HS_GRXSTSP_FRMNUM               (0xFU<<21)
#define OTG_HS_GRXSTSP_FRMNUM_0             (0x1U<<21)
#define OTG_HS_GRXSTSP_PKTSTS               (0xFU<<17)
#define OTG_HS_GRXSTSP_PKTSTS_0             (0x1U<<17)
#define OTG_HS_GRXSTSP_DPID                 (0x3U<<15)
#define OTG_HS_GRXSTSP_DPID_0               (0x1U<<15)
#define OTG_HS_GRXSTSP_BCNT                 (0x7FFU<<4)
#define OTG_HS_GRXSTSP_BCNT_0               (0x1U<<4)
#define OTG_HS_GRXSTSP_EPNUM                (0xFU<<0)
#define OTG_HS_GRXSTSP_EPNUM_0              (0x1U<<0)

// GRXFSIZ Configuration

#define OTG_HS_GRXFSIZ_RXFD                 (0xFFFFU<<0)
#define OTG_HS_GRXFSIZ_RXFD_0               (0x1U<<0)

// HNPTXFSIZ Configuration

