Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
#define OTG_HS_HNPTXFSIZ_NPTXFD             (0xFFFFU<<16)
#define OTG_HS_HNPTXFSIZ_NPTXFD_0           (0x1U<<16)
#define OTG_HS_HNPTXFSIZ_NPTXFSA            (0xFFFFU<<0)
#define OTG_HS_HNPTXFSIZ_NPTXFSA_0          (0x1U<<0)

// HNPTXSTS Configuration

#define OTG_HS_HNPTXSTS_NPTXQTOP            (0x7FU<<24)
#define OTG_HS_HNPTXSTS_NPTXQTOP_0          (0x1U<<24)
#define OTG_HS_HNPTXSTS_NPTQXSAV            (0xFFU<<16)
#define OTG_HS_HNPTXSTS_NPTQXSAV_0          (0x1U<<16)
#define OTG_HS_HNPTXSTS_NPTXFSAV            (0xFFFFU<<0)
#define OTG_HS_HNPTXSTS_NPTXFSAV_0          (0x1U<<0)

// GCCFG Configuration

#define OTG_HS_GCCFG_VBDEN                  (0x1U<<21)
#define OTG_HS_GCCFG_SDEN                   (0x1U<<20)
#define OTG_HS_GCCFG_PDEN                   (0x1U<<19)
#define OTG_HS_GCCFG_DCDEN                  (0x1U<<18)
#define OTG_HS_GCCFG_BCDEN                  (0x1U<<17)
#define OTG_HS_GCCFG_PWRDWN                 (0x1U<<16)
#define OTG_HS_GCCFG_PS2DET                 (0x1U<<3)
#define OTG_HS_GCCFG_SDET                   (0x1U<<2)
#define OTG_HS_GCCFG_PDET                   (0x1U<<1)
#define OTG_HS_GCCFG_DCDET                  (0x1U<<0)

// CID Configuration

#define OTG_HS_CID_PRODUCT_ID               (0xFFFFFFFFU<<0)
#define OTG_HS_CID_PRODUCT_ID_0             (0x1U<<0)

// GLPMCFG Configuration

#define OTG_HS_GLPMCFG_ENBESL               (0x1U<<28)
#define OTG_HS_GLPMCFG_LPMRCNTSTS           (0x7U<<25)
#define OTG_HS_GLPMCFG_LPMRCNTSTS_0         (0x1U<<25)
#define OTG_HS_GLPMCFG_SNDLPM               (0x1U<<24)
#define OTG_HS_GLPMCFG_LPMRCNT              (0x7U<<21)
#define OTG_HS_GLPMCFG_LPMRCNT_0            (0x1U<<21)
#define OTG_HS_GLPMCFG_LPMCHIDX             (0xFU<<17)
#define OTG_HS_GLPMCFG_LPMCHIDX_0           (0x1U<<17)
#define OTG_HS_GLPMCFG_L1RSMOK              (0x1U<<16)
#define OTG_HS_GLPMCFG_SLPSTS               (0x1U<<15)
#define OTG_HS_GLPMCFG_LPMRSP               (0x3U<<13)
#define OTG_HS_GLPMCFG_LPMRSP_0             (0x1U<<13)
#define OTG_HS_GLPMCFG_L1DSEN               (0x1U<<12)
#define OTG_HS_GLPMCFG_BESLTHRS             (0xFU<<8)
#define OTG_HS_GLPMCFG_BESLTHRS_0           (0x1U<<8)
#define OTG_HS_GLPMCFG_L1SSEN               (0x1U<<7)
#define OTG_HS_GLPMCFG_REMWAKE              (0x1U<<6)
#define OTG_HS_GLPMCFG_BESL                 (0xFU<<2)
#define OTG_HS_GLPMCFG_BESL_0               (0x1U<<2)
#define OTG_HS_GLPMCFG_LPMACK               (0x1U<<1)
#define OTG_HS_GLPMCFG_LPMEN                (0x1U<<0)

// HPTXFSIZ Configuration

#define OTG_HS_HPTXFSIZ_PTXFSIZ             (0xFFFFU<<16)
#define OTG_HS_HPTXFSIZ_PTXFSIZ_0           (0x1U<<16)
#define OTG_HS_HPTXFSIZ_PTXSA               (0xFFFFU<<0)
#define OTG_HS_HPTXFSIZ_PTXSA_0             (0x1U<<0)

// DIEPTXF1 Configuration

#define OTG_HS_DIEPTXF1_INEPTXFD            (0xFFFFU<<16)
#define OTG_HS_DIEPTXF1_INEPTXFD_0          (0x1U<<16)
#define OTG_HS_DIEPTXF1_INEPTXSA            (0xFFFFU<<0)
#define OTG_HS_DIEPTXF1_INEPTXSA_0          (0x1U<<0)

// DIEPTXF2 Configuration

#define OTG_HS_DIEPTXF2_INEPTXFD            (0xFFFFU<<16)
#define OTG_HS_DIEPTXF2_INEPTXFD_0          (0x1U<<16)
#define OTG_HS_DIEPTXF2_INEPTXSA            (0xFFFFU<<0)
#define OTG_HS_DIEPTXF2_INEPTXSA_0          (0x1U<<0)

// DIEPTXF3 Configuration

#define OTG_HS_DIEPTXF3_INEPTXFD            (0xFFFFU<<16)
#define OTG_HS_DIEPTXF3_INEPTXFD_0          (0x1U<<16)
#define OTG_HS_DIEPTXF3_INEPTXSA            (0xFFFFU<<0)
#define OTG_HS_DIEPTXF3_INEPTXSA_0          (0x1U<<0)

// DIEPTXF4 Configuration

#define OTG_HS_DIEPTXF4_INEPTXFD            (0xFFFFU<<16)
#define OTG_HS_DIEPTXF4_INEPTXFD_0          (0x1U<<16)
#define OTG_HS_DIEPTXF4_INEPTXSA            (0xFFFFU<<0)
#define OTG_HS_DIEPTXF4_INEPTXSA_0          (0x1U<<0)

// DIEPTXF5 Configuration

#define OTG_HS_DIEPTXF5_INEPTXFD            (0xFFFFU<<16)
#define OTG_HS_DIEPTXF5_INEPTXFD_0          (0x1U<<16)
#define OTG_HS_DIEPTXF5_INEPTXSA            (0xFFFFU<<0)
#define OTG_HS_DIEPTXF5_INEPTXSA_0          (0x1U<<0)

// DIEPTXF6 Configuration

#define OTG_HS_DIEPTXF6_INEPTXFD            (0xFFFFU<<16)
#define OTG_HS_DIEPTXF6_INEPTXFD_0          (0x1U<<16)
#define OTG_HS_DIEPTXF6_INEPTXSA            (0xFFFFU<<0)
#define OTG_HS_DIEPTXF6_INEPTXSA_0          (0x1U<<0)

// DIEPTXF7 Configuration

#define OTG_HS_DIEPTXF7_INEPTXFD            (0xFFFFU<<16)
#define OTG_HS_DIEPTXF7_INEPTXFD_0          (0x1U<<16)
#define OTG_HS_DIEPTXF7_INEPTXSA            (0xFFFFU<<0)
#define OTG_HS_DIEPTXF7_INEPTXSA_0          (0x1U<<0)

// DIEPTXF8 Configuration

#define OTG_HS_DIEPTXF8_INEPTXFD            (0xFFFFU<<16)
#define OTG_HS_DIEPTXF8_INEPTXFD_0          (0x1U<<16)
#define OTG_HS_DIEPTXF8_INEPTXSA            (0xFFFFU<<0)
#define OTG_HS_DIEPTXF8_INEPTXSA_0          (0x1U<<0)

// HCFG Configuration

#define OTG_HS_HCFG_FSLSS                   (0x1U<<2)
#define OTG_HS_HCFG_FSLSPCS                 (0x3U<<0)
#define OTG_HS_HCFG_FSLSPCS_0               (0x1U<<0)

// HFIR Configuration

#define OTG_HS_HFIR_RLDCTRL                 (0x1U<<16)
#define OTG_HS_HFIR_FRIVL                   (0xFFFFU<<0)
#define OTG_HS_HFIR_FRIVL_0                 (0x1U<<0)

// HFNUM Configuration

#define OTG_HS_HFNUM_FTREM                  (0xFFFFU<<16)
#define OTG_HS_HFNUM_FTREM_0                (0x1U<<16)
#define OTG_HS_HFNUM_FRNUM                  (0xFFFFU<<0)
#define OTG_HS_HFNUM_FRNUM_0                (0x1U<<0)

// HPTXSTS Configuration

#define OTG_HS_HPTXSTS_PTXQTOP              (0xFFU<<24)
#define OTG_HS_HPTXSTS_PTXQTOP_0            (0x1U<<24)
#define OTG_HS_HPTXSTS_PTXQSAV              (0xFFU<<16)
#define OTG_HS_HPTXSTS_PTXQSAV_0            (0x1U<<16)
#define OTG_HS_HPTXSTS_PTXFSAVL             (0xFFFFU<<0)
#define OTG_HS_HPTXSTS_PTXFSAVL_0           (0x1U<<0)

// HAINT Configuration

#define OTG_HS_HAINT_HAINT                  (0xFFFFU<<0)
#define OTG_HS_HAINT_HAINT_0                (0x1U<<0)

// HAINTMSK Configuration

#define OTG_HS_HAINTMSK_HAINTM              (0xFFFFU<<0)
#define OTG_HS_HAINTMSK_HAINTM_0            (0x1U<<0)

// HPRT Configuration

#define OTG_HS_HPRT_PSPD                    (0x3U<<17)
#define OTG_HS_HPRT_PSPD_0                  (0x1U<<17)
#define OTG_HS_HPRT_PTCTL                   (0xFU<<13)
#define OTG_HS_HPRT_PTCTL_0                 (0x1U<<13)
#define OTG_HS_HPRT_PPWR                    (0x1U<<12)
#define OTG_HS_HPRT_PLSTS                   (0x3U<<10)
#define OTG_HS_HPRT_PLSTS_0                 (0x1U<<10)
#define OTG_HS_HPRT_PRST                    (0x1U<<8)
#define OTG_HS_HPRT_PSUSP                   (0x1U<<7)
#define OTG_HS_HPRT_PRES                    (0x1U<<6)
#define OTG_HS_HPRT_POCCHNG                 (0x1U<<5)
#define OTG_HS_HPRT_POCA                    (0x1U<<4)
#define OTG_HS_HPRT_PENCHNG                 (0x1U<<3)
#define OTG_HS_HPRT_PENA                    (0x1U<<2)
#define OTG_HS_HPRT_PCDET                   (0x1U<<1)
#define OTG_HS_HPRT_PCSTS                   (0x1U<<0)

// HCCHAR0 Configuration

#define OTG_HS_HCCHAR0_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR0_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR0_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR0_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR0_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR0_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR0_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR0_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR0_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR0_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR0_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR0_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR0_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR0_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR0_MPSIZ_0              (0x1U<<0)

// HCSPLT0 Configuration

#define OTG_HS_HCSPLT0_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT0_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT0_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT0_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT0_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT0_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT0_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT0_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT0_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT0_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT0_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT0_XACTPOS_B_0X1        (0x1U<<14)

// HCINT0 Configuration

#define OTG_HS_HCINT0_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT0_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT0_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT0_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT0_ACK                   (0x1U<<5)
#define OTG_HS_HCINT0_NAK                   (0x1U<<4)
#define OTG_HS_HCINT0_STALL                 (0x1U<<3)
#define OTG_HS_HCINT0_CHH                   (0x1U<<1)
#define OTG_HS_HCINT0_XFRC                  (0x1U<<0)

// HCINTMSK0 Configuration

