Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
#define OTG_HS_HCINTMSK0_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK0_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK0_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK0_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK0_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK0_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK0_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK0_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK0_XFRCM              (0x1U<<0)

// HCTSIZ0 Configuration

#define OTG_HS_HCTSIZ0_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ0_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ0_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ0_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ0_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ0_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ0_XFRSIZ_0             (0x1U<<0)

// HCDMA0 Configuration

#define OTG_HS_HCDMA0_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA0_DMAADDR_0             (0x1U<<0)

// HCCHAR1 Configuration

#define OTG_HS_HCCHAR1_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR1_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR1_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR1_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR1_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR1_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR1_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR1_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR1_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR1_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR1_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR1_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR1_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR1_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR1_MPSIZ_0              (0x1U<<0)

// HCSPLT1 Configuration

#define OTG_HS_HCSPLT1_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT1_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT1_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT1_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT1_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT1_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT1_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT1_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT1_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT1_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT1_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT1_XACTPOS_B_0X1        (0x1U<<14)

// HCINT1_DEVICE Configuration

#define OTG_HS_HCINT1_DEVICE_DTERR          (0x1U<<10)
#define OTG_HS_HCINT1_DEVICE_FRMOR          (0x1U<<9)
#define OTG_HS_HCINT1_DEVICE_BBERR          (0x1U<<8)
#define OTG_HS_HCINT1_DEVICE_TXERR          (0x1U<<7)
#define OTG_HS_HCINT1_DEVICE_ACK            (0x1U<<5)
#define OTG_HS_HCINT1_DEVICE_NAK            (0x1U<<4)
#define OTG_HS_HCINT1_DEVICE_STALL          (0x1U<<3)
#define OTG_HS_HCINT1_DEVICE_CHH            (0x1U<<1)
#define OTG_HS_HCINT1_DEVICE_XFRC           (0x1U<<0)

// HCINTMSK1 Configuration

#define OTG_HS_HCINTMSK1_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK1_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK1_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK1_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK1_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK1_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK1_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK1_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK1_XFRCM              (0x1U<<0)

// HCTSIZ1 Configuration

#define OTG_HS_HCTSIZ1_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ1_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ1_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ1_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ1_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ1_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ1_XFRSIZ_0             (0x1U<<0)

// HCDMA1 Configuration

#define OTG_HS_HCDMA1_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA1_DMAADDR_0             (0x1U<<0)

// HCCHAR2 Configuration

#define OTG_HS_HCCHAR2_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR2_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR2_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR2_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR2_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR2_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR2_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR2_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR2_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR2_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR2_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR2_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR2_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR2_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR2_MPSIZ_0              (0x1U<<0)

// HCSPLT2 Configuration

#define OTG_HS_HCSPLT2_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT2_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT2_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT2_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT2_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT2_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT2_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT2_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT2_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT2_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT2_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT2_XACTPOS_B_0X1        (0x1U<<14)

// HCINT2 Configuration

#define OTG_HS_HCINT2_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT2_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT2_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT2_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT2_ACK                   (0x1U<<5)
#define OTG_HS_HCINT2_NAK                   (0x1U<<4)
#define OTG_HS_HCINT2_STALL                 (0x1U<<3)
#define OTG_HS_HCINT2_CHH                   (0x1U<<1)
#define OTG_HS_HCINT2_XFRC                  (0x1U<<0)

