Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
// HCINTMSK2 Configuration

#define OTG_HS_HCINTMSK2_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK2_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK2_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK2_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK2_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK2_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK2_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK2_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK2_XFRCM              (0x1U<<0)

// HCTSIZ2 Configuration

#define OTG_HS_HCTSIZ2_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ2_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ2_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ2_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ2_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ2_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ2_XFRSIZ_0             (0x1U<<0)

// HCDMA2 Configuration

#define OTG_HS_HCDMA2_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA2_DMAADDR_0             (0x1U<<0)

// HCCHAR3 Configuration

#define OTG_HS_HCCHAR3_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR3_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR3_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR3_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR3_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR3_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR3_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR3_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR3_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR3_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR3_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR3_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR3_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR3_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR3_MPSIZ_0              (0x1U<<0)

// HCSPLT3 Configuration

#define OTG_HS_HCSPLT3_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT3_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT3_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT3_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT3_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT3_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT3_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT3_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT3_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT3_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT3_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT3_XACTPOS_B_0X1        (0x1U<<14)

// HCINT3 Configuration

#define OTG_HS_HCINT3_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT3_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT3_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT3_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT3_ACK                   (0x1U<<5)
#define OTG_HS_HCINT3_NAK                   (0x1U<<4)
#define OTG_HS_HCINT3_STALL                 (0x1U<<3)
#define OTG_HS_HCINT3_CHH                   (0x1U<<1)
#define OTG_HS_HCINT3_XFRC                  (0x1U<<0)

// HCINTMSK3 Configuration

#define OTG_HS_HCINTMSK3_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK3_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK3_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK3_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK3_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK3_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK3_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK3_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK3_XFRCM              (0x1U<<0)

// HCTSIZ3 Configuration

#define OTG_HS_HCTSIZ3_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ3_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ3_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ3_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ3_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ3_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ3_XFRSIZ_0             (0x1U<<0)

// HCDMA3 Configuration

#define OTG_HS_HCDMA3_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA3_DMAADDR_0             (0x1U<<0)

// HCCHAR4 Configuration

#define OTG_HS_HCCHAR4_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR4_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR4_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR4_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR4_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR4_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR4_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR4_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR4_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR4_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR4_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR4_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR4_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR4_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR4_MPSIZ_0              (0x1U<<0)

// HCSPLT4 Configuration

#define OTG_HS_HCSPLT4_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT4_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT4_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT4_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT4_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT4_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT4_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT4_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT4_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT4_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT4_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT4_XACTPOS_B_0X1        (0x1U<<14)

// HCINT4 Configuration

#define OTG_HS_HCINT4_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT4_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT4_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT4_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT4_ACK                   (0x1U<<5)
#define OTG_HS_HCINT4_NAK                   (0x1U<<4)
#define OTG_HS_HCINT4_STALL                 (0x1U<<3)
#define OTG_HS_HCINT4_CHH                   (0x1U<<1)
#define OTG_HS_HCINT4_XFRC                  (0x1U<<0)

// HCINTMSK4 Configuration

