Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
#define OTG_HS_HCINTMSK4_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK4_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK4_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK4_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK4_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK4_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK4_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK4_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK4_XFRCM              (0x1U<<0)

// HCTSIZ4 Configuration

#define OTG_HS_HCTSIZ4_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ4_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ4_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ4_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ4_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ4_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ4_XFRSIZ_0             (0x1U<<0)

// HCDMA4 Configuration

#define OTG_HS_HCDMA4_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA4_DMAADDR_0             (0x1U<<0)

// HCCHAR5 Configuration

#define OTG_HS_HCCHAR5_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR5_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR5_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR5_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR5_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR5_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR5_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR5_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR5_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR5_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR5_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR5_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR5_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR5_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR5_MPSIZ_0              (0x1U<<0)

// HCSPLT5 Configuration

#define OTG_HS_HCSPLT5_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT5_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT5_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT5_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT5_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT5_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT5_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT5_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT5_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT5_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT5_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT5_XACTPOS_B_0X1        (0x1U<<14)

// HCINT5 Configuration

#define OTG_HS_HCINT5_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT5_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT5_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT5_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT5_ACK                   (0x1U<<5)
#define OTG_HS_HCINT5_NAK                   (0x1U<<4)
#define OTG_HS_HCINT5_STALL                 (0x1U<<3)
#define OTG_HS_HCINT5_CHH                   (0x1U<<1)
#define OTG_HS_HCINT5_XFRC                  (0x1U<<0)

// HCINTMSK5 Configuration

#define OTG_HS_HCINTMSK5_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK5_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK5_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK5_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK5_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK5_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK5_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK5_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK5_XFRCM              (0x1U<<0)

// HCTSIZ5 Configuration

#define OTG_HS_HCTSIZ5_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ5_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ5_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ5_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ5_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ5_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ5_XFRSIZ_0             (0x1U<<0)

// HCDMA5 Configuration

#define OTG_HS_HCDMA5_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA5_DMAADDR_0             (0x1U<<0)

// HCCHAR6 Configuration

#define OTG_HS_HCCHAR6_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR6_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR6_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR6_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR6_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR6_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR6_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR6_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR6_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR6_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR6_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR6_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR6_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR6_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR6_MPSIZ_0              (0x1U<<0)

// HCSPLT6 Configuration

#define OTG_HS_HCSPLT6_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT6_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT6_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT6_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT6_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT6_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT6_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT6_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT6_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT6_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT6_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT6_XACTPOS_B_0X1        (0x1U<<14)

// HCINT6 Configuration

#define OTG_HS_HCINT6_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT6_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT6_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT6_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT6_ACK                   (0x1U<<5)
#define OTG_HS_HCINT6_NAK                   (0x1U<<4)
#define OTG_HS_HCINT6_STALL                 (0x1U<<3)
#define OTG_HS_HCINT6_CHH                   (0x1U<<1)
#define OTG_HS_HCINT6_XFRC                  (0x1U<<0)

// HCINTMSK6 Configuration

#define OTG_HS_HCINTMSK6_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK6_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK6_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK6_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK6_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK6_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK6_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK6_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK6_XFRCM              (0x1U<<0)

// HCTSIZ6 Configuration

#define OTG_HS_HCTSIZ6_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ6_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ6_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ6_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ6_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ6_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ6_XFRSIZ_0             (0x1U<<0)

// HCDMA6 Configuration

#define OTG_HS_HCDMA6_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA6_DMAADDR_0             (0x1U<<0)

// HCCHAR7 Configuration

