Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
#define OTG_HS_HCCHAR7_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR7_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR7_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR7_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR7_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR7_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR7_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR7_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR7_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR7_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR7_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR7_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR7_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR7_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR7_MPSIZ_0              (0x1U<<0)

// HCSPLT7 Configuration

#define OTG_HS_HCSPLT7_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT7_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT7_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT7_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT7_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT7_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT7_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT7_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT7_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT7_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT7_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT7_XACTPOS_B_0X1        (0x1U<<14)

// HCINT7 Configuration

#define OTG_HS_HCINT7_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT7_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT7_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT7_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT7_ACK                   (0x1U<<5)
#define OTG_HS_HCINT7_NAK                   (0x1U<<4)
#define OTG_HS_HCINT7_STALL                 (0x1U<<3)
#define OTG_HS_HCINT7_CHH                   (0x1U<<1)
#define OTG_HS_HCINT7_XFRC                  (0x1U<<0)

// HCINTMSK7 Configuration

#define OTG_HS_HCINTMSK7_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK7_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK7_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK7_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK7_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK7_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK7_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK7_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK7_XFRCM              (0x1U<<0)

// HCTSIZ7 Configuration

#define OTG_HS_HCTSIZ7_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ7_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ7_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ7_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ7_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ7_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ7_XFRSIZ_0             (0x1U<<0)

// HCDMA7 Configuration

#define OTG_HS_HCDMA7_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA7_DMAADDR_0             (0x1U<<0)

// HCCHAR8 Configuration

#define OTG_HS_HCCHAR8_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR8_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR8_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR8_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR8_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR8_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR8_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR8_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR8_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR8_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR8_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR8_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR8_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR8_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR8_MPSIZ_0              (0x1U<<0)

// HCSPLT8 Configuration

#define OTG_HS_HCSPLT8_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT8_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT8_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT8_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT8_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT8_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT8_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT8_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT8_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT8_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT8_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT8_XACTPOS_B_0X1        (0x1U<<14)

// HCINT8 Configuration

#define OTG_HS_HCINT8_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT8_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT8_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT8_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT8_ACK                   (0x1U<<5)
#define OTG_HS_HCINT8_NAK                   (0x1U<<4)
#define OTG_HS_HCINT8_STALL                 (0x1U<<3)
#define OTG_HS_HCINT8_CHH                   (0x1U<<1)
#define OTG_HS_HCINT8_XFRC                  (0x1U<<0)

// HCINTMSK8 Configuration

#define OTG_HS_HCINTMSK8_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK8_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK8_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK8_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK8_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK8_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK8_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK8_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK8_XFRCM              (0x1U<<0)

// HCTSIZ8 Configuration

#define OTG_HS_HCTSIZ8_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ8_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ8_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ8_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ8_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ8_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ8_XFRSIZ_0             (0x1U<<0)

// HCDMA8 Configuration

#define OTG_HS_HCDMA8_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA8_DMAADDR_0             (0x1U<<0)

