Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
// HCCHAR9 Configuration

#define OTG_HS_HCCHAR9_CHENA                (0x1U<<31)
#define OTG_HS_HCCHAR9_CHDIS                (0x1U<<30)
#define OTG_HS_HCCHAR9_ODDFRM               (0x1U<<29)
#define OTG_HS_HCCHAR9_DAD                  (0x7FU<<22)
#define OTG_HS_HCCHAR9_DAD_0                (0x1U<<22)
#define OTG_HS_HCCHAR9_MCNT                 (0x3U<<20)
#define OTG_HS_HCCHAR9_MCNT_0               (0x1U<<20)
#define OTG_HS_HCCHAR9_EPTYP                (0x3U<<18)
#define OTG_HS_HCCHAR9_EPTYP_0              (0x1U<<18)
#define OTG_HS_HCCHAR9_LSDEV                (0x1U<<17)
#define OTG_HS_HCCHAR9_EPDIR                (0x1U<<15)
#define OTG_HS_HCCHAR9_EPNUM                (0xFU<<11)
#define OTG_HS_HCCHAR9_EPNUM_0              (0x1U<<11)
#define OTG_HS_HCCHAR9_MPSIZ                (0x7FFU<<0)
#define OTG_HS_HCCHAR9_MPSIZ_0              (0x1U<<0)

// HCSPLT9 Configuration

#define OTG_HS_HCSPLT9_SPLITEN              (0x1U<<31)
#define OTG_HS_HCSPLT9_COMPLSPLT            (0x1U<<16)
#define OTG_HS_HCSPLT9_XACTPOS              (0x3U<<14)
#define OTG_HS_HCSPLT9_XACTPOS_0            (0x1U<<14)
#define OTG_HS_HCSPLT9_HUBADDR              (0x7FU<<7)
#define OTG_HS_HCSPLT9_HUBADDR_0            (0x1U<<7)
#define OTG_HS_HCSPLT9_PRTADDR              (0x7FU<<0)
#define OTG_HS_HCSPLT9_PRTADDR_0            (0x1U<<0)
#define OTG_HS_HCSPLT9_XACTPOS_B_0X3        (0x3U<<14)
#define OTG_HS_HCSPLT9_XACTPOS_B_0X2        (0x2U<<14)
#define OTG_HS_HCSPLT9_XACTPOS_B_0X0        (0x0U<<14)
#define OTG_HS_HCSPLT9_XACTPOS_B_0X1        (0x1U<<14)

// HCINT9 Configuration

#define OTG_HS_HCINT9_DTERR                 (0x1U<<10)
#define OTG_HS_HCINT9_FRMOR                 (0x1U<<9)
#define OTG_HS_HCINT9_BBERR                 (0x1U<<8)
#define OTG_HS_HCINT9_TXERR                 (0x1U<<7)
#define OTG_HS_HCINT9_ACK                   (0x1U<<5)
#define OTG_HS_HCINT9_NAK                   (0x1U<<4)
#define OTG_HS_HCINT9_STALL                 (0x1U<<3)
#define OTG_HS_HCINT9_CHH                   (0x1U<<1)
#define OTG_HS_HCINT9_XFRC                  (0x1U<<0)

// HCINTMSK9 Configuration

#define OTG_HS_HCINTMSK9_DTERRM             (0x1U<<10)
#define OTG_HS_HCINTMSK9_FRMORM             (0x1U<<9)
#define OTG_HS_HCINTMSK9_BBERRM             (0x1U<<8)
#define OTG_HS_HCINTMSK9_TXERRM             (0x1U<<7)
#define OTG_HS_HCINTMSK9_ACKM               (0x1U<<5)
#define OTG_HS_HCINTMSK9_NAKM               (0x1U<<4)
#define OTG_HS_HCINTMSK9_STALLM             (0x1U<<3)
#define OTG_HS_HCINTMSK9_CHHM               (0x1U<<1)
#define OTG_HS_HCINTMSK9_XFRCM              (0x1U<<0)

// HCTSIZ9 Configuration

#define OTG_HS_HCTSIZ9_DOPNG                (0x1U<<31)
#define OTG_HS_HCTSIZ9_DPID                 (0x3U<<29)
#define OTG_HS_HCTSIZ9_DPID_0               (0x1U<<29)
#define OTG_HS_HCTSIZ9_PKTCNT               (0x3FFU<<19)
#define OTG_HS_HCTSIZ9_PKTCNT_0             (0x1U<<19)
#define OTG_HS_HCTSIZ9_XFRSIZ               (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ9_XFRSIZ_0             (0x1U<<0)

// HCDMA9 Configuration

#define OTG_HS_HCDMA9_DMAADDR               (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA9_DMAADDR_0             (0x1U<<0)

// HCCHAR10 Configuration

#define OTG_HS_HCCHAR10_CHENA               (0x1U<<31)
#define OTG_HS_HCCHAR10_CHDIS               (0x1U<<30)
#define OTG_HS_HCCHAR10_ODDFRM              (0x1U<<29)
#define OTG_HS_HCCHAR10_DAD                 (0x7FU<<22)
#define OTG_HS_HCCHAR10_DAD_0               (0x1U<<22)
#define OTG_HS_HCCHAR10_MCNT                (0x3U<<20)
#define OTG_HS_HCCHAR10_MCNT_0              (0x1U<<20)
#define OTG_HS_HCCHAR10_EPTYP               (0x3U<<18)
#define OTG_HS_HCCHAR10_EPTYP_0             (0x1U<<18)
#define OTG_HS_HCCHAR10_LSDEV               (0x1U<<17)
#define OTG_HS_HCCHAR10_EPDIR               (0x1U<<15)
#define OTG_HS_HCCHAR10_EPNUM               (0xFU<<11)
#define OTG_HS_HCCHAR10_EPNUM_0             (0x1U<<11)
#define OTG_HS_HCCHAR10_MPSIZ               (0x7FFU<<0)
#define OTG_HS_HCCHAR10_MPSIZ_0             (0x1U<<0)

// HCSPLT10 Configuration

#define OTG_HS_HCSPLT10_SPLITEN             (0x1U<<31)
#define OTG_HS_HCSPLT10_COMPLSPLT           (0x1U<<16)
#define OTG_HS_HCSPLT10_XACTPOS             (0x3U<<14)
#define OTG_HS_HCSPLT10_XACTPOS_0           (0x1U<<14)
#define OTG_HS_HCSPLT10_HUBADDR             (0x7FU<<7)
#define OTG_HS_HCSPLT10_HUBADDR_0           (0x1U<<7)
#define OTG_HS_HCSPLT10_PRTADDR             (0x7FU<<0)
#define OTG_HS_HCSPLT10_PRTADDR_0           (0x1U<<0)
#define OTG_HS_HCSPLT10_XACTPOS_B_0X3       (0x3U<<14)
#define OTG_HS_HCSPLT10_XACTPOS_B_0X2       (0x2U<<14)
#define OTG_HS_HCSPLT10_XACTPOS_B_0X0       (0x0U<<14)
#define OTG_HS_HCSPLT10_XACTPOS_B_0X1       (0x1U<<14)

// HCINT10 Configuration

#define OTG_HS_HCINT10_DTERR                (0x1U<<10)
#define OTG_HS_HCINT10_FRMOR                (0x1U<<9)
#define OTG_HS_HCINT10_BBERR                (0x1U<<8)
#define OTG_HS_HCINT10_TXERR                (0x1U<<7)
#define OTG_HS_HCINT10_ACK                  (0x1U<<5)
#define OTG_HS_HCINT10_NAK                  (0x1U<<4)
#define OTG_HS_HCINT10_STALL                (0x1U<<3)
#define OTG_HS_HCINT10_CHH                  (0x1U<<1)
#define OTG_HS_HCINT10_XFRC                 (0x1U<<0)

// HCINTMSK10 Configuration

#define OTG_HS_HCINTMSK10_DTERRM            (0x1U<<10)
#define OTG_HS_HCINTMSK10_FRMORM            (0x1U<<9)
#define OTG_HS_HCINTMSK10_BBERRM            (0x1U<<8)
#define OTG_HS_HCINTMSK10_TXERRM            (0x1U<<7)
#define OTG_HS_HCINTMSK10_ACKM              (0x1U<<5)
#define OTG_HS_HCINTMSK10_NAKM              (0x1U<<4)
#define OTG_HS_HCINTMSK10_STALLM            (0x1U<<3)
#define OTG_HS_HCINTMSK10_CHHM              (0x1U<<1)
#define OTG_HS_HCINTMSK10_XFRCM             (0x1U<<0)

// HCTSIZ10 Configuration

#define OTG_HS_HCTSIZ10_DOPNG               (0x1U<<31)
#define OTG_HS_HCTSIZ10_DPID                (0x3U<<29)
#define OTG_HS_HCTSIZ10_DPID_0              (0x1U<<29)
#define OTG_HS_HCTSIZ10_PKTCNT              (0x3FFU<<19)
#define OTG_HS_HCTSIZ10_PKTCNT_0            (0x1U<<19)
#define OTG_HS_HCTSIZ10_XFRSIZ              (0x7FFFFU<<0)
#define OTG_HS_HCTSIZ10_XFRSIZ_0            (0x1U<<0)

// HCDMA10 Configuration

#define OTG_HS_HCDMA10_DMAADDR              (0xFFFFFFFFU<<0)
#define OTG_HS_HCDMA10_DMAADDR_0            (0x1U<<0)

// HCCHAR11 Configuration

#define OTG_HS_HCCHAR11_CHENA               (0x1U<<31)
#define OTG_HS_HCCHAR11_CHDIS               (0x1U<<30)
#define OTG_HS_HCCHAR11_ODDFRM              (0x1U<<29)
#define OTG_HS_HCCHAR11_DAD                 (0x7FU<<22)
#define OTG_HS_HCCHAR11_DAD_0               (0x1U<<22)
#define OTG_HS_HCCHAR11_MCNT                (0x3U<<20)
#define OTG_HS_HCCHAR11_MCNT_0              (0x1U<<20)
#define OTG_HS_HCCHAR11_EPTYP               (0x3U<<18)
#define OTG_HS_HCCHAR11_EPTYP_0             (0x1U<<18)
#define OTG_HS_HCCHAR11_LSDEV               (0x1U<<17)
#define OTG_HS_HCCHAR11_EPDIR               (0x1U<<15)
#define OTG_HS_HCCHAR11_EPNUM               (0xFU<<11)
#define OTG_HS_HCCHAR11_EPNUM_0             (0x1U<<11)
#define OTG_HS_HCCHAR11_MPSIZ               (0x7FFU<<0)
#define OTG_HS_HCCHAR11_MPSIZ_0             (0x1U<<0)

// HCSPLT11 Configuration

#define OTG_HS_HCSPLT11_SPLITEN             (0x1U<<31)
#define OTG_HS_HCSPLT11_COMPLSPLT           (0x1U<<16)
#define OTG_HS_HCSPLT11_XACTPOS             (0x3U<<14)
#define OTG_HS_HCSPLT11_XACTPOS_0           (0x1U<<14)
#define OTG_HS_HCSPLT11_HUBADDR             (0x7FU<<7)
#define OTG_HS_HCSPLT11_HUBADDR_0           (0x1U<<7)
#define OTG_HS_HCSPLT11_PRTADDR             (0x7FU<<0)
#define OTG_HS_HCSPLT11_PRTADDR_0           (0x1U<<0)
#define OTG_HS_HCSPLT11_XACTPOS_B_0X3       (0x3U<<14)
#define OTG_HS_HCSPLT11_XACTPOS_B_0X2       (0x2U<<14)
#define OTG_HS_HCSPLT11_XACTPOS_B_0X0       (0x0U<<14)
#define OTG_HS_HCSPLT11_XACTPOS_B_0X1       (0x1U<<14)

// HCINT11 Configuration

#define OTG_HS_HCINT11_DTERR                (0x1U<<10)
#define OTG_HS_HCINT11_FRMOR                (0x1U<<9)
#define OTG_HS_HCINT11_BBERR                (0x1U<<8)
#define OTG_HS_HCINT11_TXERR                (0x1U<<7)
#define OTG_HS_HCINT11_ACK                  (0x1U<<5)
#define OTG_HS_HCINT11_NAK                  (0x1U<<4)
#define OTG_HS_HCINT11_STALL                (0x1U<<3)
#define OTG_HS_HCINT11_CHH                  (0x1U<<1)
#define OTG_HS_HCINT11_XFRC                 (0x1U<<0)

