Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
// DCFG Configuration

#define OTG_HS_DCFG_ERRATIM                 (0x1U<<15)
#define OTG_HS_DCFG_PFIVL                   (0x3U<<11)
#define OTG_HS_DCFG_PFIVL_0                 (0x1U<<11)
#define OTG_HS_DCFG_DAD                     (0x7FU<<4)
#define OTG_HS_DCFG_DAD_0                   (0x1U<<4)
#define OTG_HS_DCFG_NZLSOHSK                (0x1U<<2)
#define OTG_HS_DCFG_DSPD                    (0x3U<<0)
#define OTG_HS_DCFG_DSPD_0                  (0x1U<<0)

// DCTL Configuration

#define OTG_HS_DCTL_DSBESLRJCT              (0x1U<<18)
#define OTG_HS_DCTL_POPRGDNE                (0x1U<<11)
#define OTG_HS_DCTL_CGONAK                  (0x1U<<10)
#define OTG_HS_DCTL_SGONAK                  (0x1U<<9)
#define OTG_HS_DCTL_CGINAK                  (0x1U<<8)
#define OTG_HS_DCTL_SGINAK                  (0x1U<<7)
#define OTG_HS_DCTL_TCTL                    (0x7U<<4)
#define OTG_HS_DCTL_TCTL_0                  (0x1U<<4)
#define OTG_HS_DCTL_GONSTS                  (0x1U<<3)
#define OTG_HS_DCTL_GINSTS                  (0x1U<<2)
#define OTG_HS_DCTL_SDIS                    (0x1U<<1)
#define OTG_HS_DCTL_RWUSIG                  (0x1U<<0)

// DSTS Configuration

#define OTG_HS_DSTS_DEVLNSTS                (0x3U<<22)
#define OTG_HS_DSTS_DEVLNSTS_0              (0x1U<<22)
#define OTG_HS_DSTS_FNSOF                   (0x3FFFU<<8)
#define OTG_HS_DSTS_FNSOF_0                 (0x1U<<8)
#define OTG_HS_DSTS_EERR                    (0x1U<<3)
#define OTG_HS_DSTS_ENUMSPD                 (0x3U<<1)
#define OTG_HS_DSTS_ENUMSPD_0               (0x1U<<1)
#define OTG_HS_DSTS_SUSPSTS                 (0x1U<<0)

// DIEPMSK Configuration

#define OTG_HS_DIEPMSK_NAKM                 (0x1U<<13)
#define OTG_HS_DIEPMSK_TXFURM               (0x1U<<8)
#define OTG_HS_DIEPMSK_INEPNEM              (0x1U<<6)
#define OTG_HS_DIEPMSK_INEPNMM              (0x1U<<5)
#define OTG_HS_DIEPMSK_ITTXFEMSK            (0x1U<<4)
#define OTG_HS_DIEPMSK_TOM                  (0x1U<<3)
#define OTG_HS_DIEPMSK_AHBERRM              (0x1U<<2)
#define OTG_HS_DIEPMSK_EPDM                 (0x1U<<1)
#define OTG_HS_DIEPMSK_XFRCM                (0x1U<<0)

// DOEPMSK Configuration

#define OTG_HS_DOEPMSK_NYETMSK              (0x1U<<14)
#define OTG_HS_DOEPMSK_NAKMSK               (0x1U<<13)
#define OTG_HS_DOEPMSK_BERRM                (0x1U<<12)
#define OTG_HS_DOEPMSK_OUTPKTERRM           (0x1U<<8)
#define OTG_HS_DOEPMSK_B2BSTUPM             (0x1U<<6)
#define OTG_HS_DOEPMSK_STSPHSRXM            (0x1U<<5)
#define OTG_HS_DOEPMSK_OTEPDM               (0x1U<<4)
#define OTG_HS_DOEPMSK_STUPM                (0x1U<<3)
#define OTG_HS_DOEPMSK_AHBERRM              (0x1U<<2)
#define OTG_HS_DOEPMSK_EPDM                 (0x1U<<1)
#define OTG_HS_DOEPMSK_XFRCM                (0x1U<<0)

// DAINT Configuration

#define OTG_HS_DAINT_OEPINT                 (0xFFFFU<<16)
#define OTG_HS_DAINT_OEPINT_0               (0x1U<<16)
#define OTG_HS_DAINT_IEPINT                 (0xFFFFU<<0)
#define OTG_HS_DAINT_IEPINT_0               (0x1U<<0)

// DAINTMSK Configuration

#define OTG_HS_DAINTMSK_OEPM                (0xFFFFU<<16)
#define OTG_HS_DAINTMSK_OEPM_0              (0x1U<<16)
#define OTG_HS_DAINTMSK_IEPM                (0xFFFFU<<0)
#define OTG_HS_DAINTMSK_IEPM_0              (0x1U<<0)

// DVBUSDIS Configuration

#define OTG_HS_DVBUSDIS_VBUSDT              (0xFFFFU<<0)
#define OTG_HS_DVBUSDIS_VBUSDT_0            (0x1U<<0)

// DVBUSPULSE Configuration

#define OTG_HS_DVBUSPULSE_DVBUSP            (0xFFFFU<<0)
#define OTG_HS_DVBUSPULSE_DVBUSP_0          (0x1U<<0)

// DTHRCTL Configuration

#define OTG_HS_DTHRCTL_ARPEN                (0x1U<<27)
#define OTG_HS_DTHRCTL_RXTHRLEN             (0x1FFU<<17)
#define OTG_HS_DTHRCTL_RXTHRLEN_0           (0x1U<<17)
#define OTG_HS_DTHRCTL_RXTHREN              (0x1U<<16)
#define OTG_HS_DTHRCTL_TXTHRLEN             (0x1FFU<<2)
#define OTG_HS_DTHRCTL_TXTHRLEN_0           (0x1U<<2)
#define OTG_HS_DTHRCTL_ISOTHREN             (0x1U<<1)
#define OTG_HS_DTHRCTL_NONISOTHREN          (0x1U<<0)

// DIEPEMPMSK Configuration

#define OTG_HS_DIEPEMPMSK_INEPTXFEM         (0xFFFFU<<0)
#define OTG_HS_DIEPEMPMSK_INEPTXFEM_0       (0x1U<<0)

// DOEPEACHMSK1 Configuration

#define OTG_HS_DOEPEACHMSK1_NYETMSK         (0x1U<<14)
#define OTG_HS_DOEPEACHMSK1_NAKMSK          (0x1U<<13)
#define OTG_HS_DOEPEACHMSK1_BERRM           (0x1U<<12)
#define OTG_HS_DOEPEACHMSK1_BNAM            (0x1U<<9)
#define OTG_HS_DOEPEACHMSK1_OUTPKTERRM      (0x1U<<8)
#define OTG_HS_DOEPEACHMSK1_B2BSTUPM        (0x1U<<6)
#define OTG_HS_DOEPEACHMSK1_OTEPDM          (0x1U<<4)
#define OTG_HS_DOEPEACHMSK1_STUPM           (0x1U<<3)
#define OTG_HS_DOEPEACHMSK1_AHBERRM         (0x1U<<2)
#define OTG_HS_DOEPEACHMSK1_EPDM            (0x1U<<1)
#define OTG_HS_DOEPEACHMSK1_XFRCM           (0x1U<<0)

// DIEPCTL0 Configuration

#define OTG_HS_DIEPCTL0_EPENA               (0x1U<<31)
#define OTG_HS_DIEPCTL0_EPDIS               (0x1U<<30)
#define OTG_HS_DIEPCTL0_SNAK                (0x1U<<27)
#define OTG_HS_DIEPCTL0_CNAK                (0x1U<<26)
#define OTG_HS_DIEPCTL0_TXFNUM              (0xFU<<22)
#define OTG_HS_DIEPCTL0_TXFNUM_0            (0x1U<<22)
#define OTG_HS_DIEPCTL0_STALL               (0x1U<<21)
#define OTG_HS_DIEPCTL0_EPTYP               (0x3U<<18)
#define OTG_HS_DIEPCTL0_EPTYP_0             (0x1U<<18)
#define OTG_HS_DIEPCTL0_NAKSTS              (0x1U<<17)
#define OTG_HS_DIEPCTL0_USBAEP              (0x1U<<15)
#define OTG_HS_DIEPCTL0_MPSIZ               (0x3U<<0)
#define OTG_HS_DIEPCTL0_MPSIZ_0             (0x1U<<0)

// DIEPINT0 Configuration

#define OTG_HS_DIEPINT0_NAK                 (0x1U<<13)
#define OTG_HS_DIEPINT0_PKTDRPSTS           (0x1U<<11)
#define OTG_HS_DIEPINT0_TXFE                (0x1U<<7)
#define OTG_HS_DIEPINT0_INEPNE              (0x1U<<6)
#define OTG_HS_DIEPINT0_INEPNM              (0x1U<<5)
#define OTG_HS_DIEPINT0_ITTXFE              (0x1U<<4)
#define OTG_HS_DIEPINT0_TOC                 (0x1U<<3)
#define OTG_HS_DIEPINT0_EPDISD              (0x1U<<1)
#define OTG_HS_DIEPINT0_XFRC                (0x1U<<0)

// DIEPTSIZ0 Configuration

