Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
#define OTG_HS_DIEPTSIZ0_PKTCNT             (0x3U<<19)
#define OTG_HS_DIEPTSIZ0_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DIEPTSIZ0_XFRSIZ             (0x7FU<<0)
#define OTG_HS_DIEPTSIZ0_XFRSIZ_0           (0x1U<<0)

// DTXFSTS0 Configuration

#define OTG_HS_DTXFSTS0_INEPTFSAV           (0xFFFFU<<0)
#define OTG_HS_DTXFSTS0_INEPTFSAV_0         (0x1U<<0)

// DIEPCTL1 Configuration

#define OTG_HS_DIEPCTL1_EPENA               (0x1U<<31)
#define OTG_HS_DIEPCTL1_EPDIS               (0x1U<<30)
#define OTG_HS_DIEPCTL1_SODDFRM             (0x1U<<29)
#define OTG_HS_DIEPCTL1_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DIEPCTL1_SNAK                (0x1U<<27)
#define OTG_HS_DIEPCTL1_CNAK                (0x1U<<26)
#define OTG_HS_DIEPCTL1_TXFNUM              (0xFU<<22)
#define OTG_HS_DIEPCTL1_TXFNUM_0            (0x1U<<22)
#define OTG_HS_DIEPCTL1_STALL               (0x1U<<21)
#define OTG_HS_DIEPCTL1_EPTYP               (0x3U<<18)
#define OTG_HS_DIEPCTL1_EPTYP_0             (0x1U<<18)
#define OTG_HS_DIEPCTL1_NAKSTS              (0x1U<<17)
#define OTG_HS_DIEPCTL1_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DIEPCTL1_USBAEP              (0x1U<<15)
#define OTG_HS_DIEPCTL1_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DIEPCTL1_MPSIZ_0             (0x1U<<0)

// DIEPINT1 Configuration

#define OTG_HS_DIEPINT1_NAK                 (0x1U<<13)
#define OTG_HS_DIEPINT1_PKTDRPSTS           (0x1U<<11)
#define OTG_HS_DIEPINT1_TXFE                (0x1U<<7)
#define OTG_HS_DIEPINT1_INEPNE              (0x1U<<6)
#define OTG_HS_DIEPINT1_INEPNM              (0x1U<<5)
#define OTG_HS_DIEPINT1_ITTXFE              (0x1U<<4)
#define OTG_HS_DIEPINT1_TOC                 (0x1U<<3)
#define OTG_HS_DIEPINT1_EPDISD              (0x1U<<1)
#define OTG_HS_DIEPINT1_XFRC                (0x1U<<0)

// DIEPTSIZ1 Configuration

#define OTG_HS_DIEPTSIZ1_MCNT               (0x3U<<29)
#define OTG_HS_DIEPTSIZ1_MCNT_0             (0x1U<<29)
#define OTG_HS_DIEPTSIZ1_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DIEPTSIZ1_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DIEPTSIZ1_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DIEPTSIZ1_XFRSIZ_0           (0x1U<<0)

// DIEPDMA1 Configuration

#define OTG_HS_DIEPDMA1_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DIEPDMA1_DMAADDR_0           (0x1U<<0)

// DTXFSTS1 Configuration

#define OTG_HS_DTXFSTS1_INEPTFSAV           (0xFFFFU<<0)
#define OTG_HS_DTXFSTS1_INEPTFSAV_0         (0x1U<<0)

// DIEPCTL2 Configuration

#define OTG_HS_DIEPCTL2_EPENA               (0x1U<<31)
#define OTG_HS_DIEPCTL2_EPDIS               (0x1U<<30)
#define OTG_HS_DIEPCTL2_SODDFRM             (0x1U<<29)
#define OTG_HS_DIEPCTL2_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DIEPCTL2_SNAK                (0x1U<<27)
#define OTG_HS_DIEPCTL2_CNAK                (0x1U<<26)
#define OTG_HS_DIEPCTL2_TXFNUM              (0xFU<<22)
#define OTG_HS_DIEPCTL2_TXFNUM_0            (0x1U<<22)
#define OTG_HS_DIEPCTL2_STALL               (0x1U<<21)
#define OTG_HS_DIEPCTL2_EPTYP               (0x3U<<18)
#define OTG_HS_DIEPCTL2_EPTYP_0             (0x1U<<18)
#define OTG_HS_DIEPCTL2_NAKSTS              (0x1U<<17)
#define OTG_HS_DIEPCTL2_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DIEPCTL2_USBAEP              (0x1U<<15)
#define OTG_HS_DIEPCTL2_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DIEPCTL2_MPSIZ_0             (0x1U<<0)

// DIEPINT2 Configuration

#define OTG_HS_DIEPINT2_NAK                 (0x1U<<13)
#define OTG_HS_DIEPINT2_PKTDRPSTS           (0x1U<<11)
#define OTG_HS_DIEPINT2_TXFE                (0x1U<<7)
#define OTG_HS_DIEPINT2_INEPNE              (0x1U<<6)
#define OTG_HS_DIEPINT2_INEPNM              (0x1U<<5)
#define OTG_HS_DIEPINT2_ITTXFE              (0x1U<<4)
#define OTG_HS_DIEPINT2_TOC                 (0x1U<<3)
#define OTG_HS_DIEPINT2_EPDISD              (0x1U<<1)
#define OTG_HS_DIEPINT2_XFRC                (0x1U<<0)

// DIEPTSIZ2 Configuration

#define OTG_HS_DIEPTSIZ2_MCNT               (0x3U<<29)
#define OTG_HS_DIEPTSIZ2_MCNT_0             (0x1U<<29)
#define OTG_HS_DIEPTSIZ2_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DIEPTSIZ2_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DIEPTSIZ2_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DIEPTSIZ2_XFRSIZ_0           (0x1U<<0)

// DIEPDMA2 Configuration

#define OTG_HS_DIEPDMA2_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DIEPDMA2_DMAADDR_0           (0x1U<<0)

// DTXFSTS2 Configuration

#define OTG_HS_DTXFSTS2_INEPTFSAV           (0xFFFFU<<0)
#define OTG_HS_DTXFSTS2_INEPTFSAV_0         (0x1U<<0)

// DIEPCTL3 Configuration

#define OTG_HS_DIEPCTL3_EPENA               (0x1U<<31)
#define OTG_HS_DIEPCTL3_EPDIS               (0x1U<<30)
#define OTG_HS_DIEPCTL3_SODDFRM             (0x1U<<29)
#define OTG_HS_DIEPCTL3_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DIEPCTL3_SNAK                (0x1U<<27)
#define OTG_HS_DIEPCTL3_CNAK                (0x1U<<26)
#define OTG_HS_DIEPCTL3_TXFNUM              (0xFU<<22)
#define OTG_HS_DIEPCTL3_TXFNUM_0            (0x1U<<22)
#define OTG_HS_DIEPCTL3_STALL               (0x1U<<21)
#define OTG_HS_DIEPCTL3_EPTYP               (0x3U<<18)
#define OTG_HS_DIEPCTL3_EPTYP_0             (0x1U<<18)
#define OTG_HS_DIEPCTL3_NAKSTS              (0x1U<<17)
#define OTG_HS_DIEPCTL3_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DIEPCTL3_USBAEP              (0x1U<<15)
#define OTG_HS_DIEPCTL3_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DIEPCTL3_MPSIZ_0             (0x1U<<0)

// DIEPINT3 Configuration

#define OTG_HS_DIEPINT3_NAK                 (0x1U<<13)
#define OTG_HS_DIEPINT3_PKTDRPSTS           (0x1U<<11)
#define OTG_HS_DIEPINT3_TXFE                (0x1U<<7)
#define OTG_HS_DIEPINT3_INEPNE              (0x1U<<6)
#define OTG_HS_DIEPINT3_INEPNM              (0x1U<<5)
#define OTG_HS_DIEPINT3_ITTXFE              (0x1U<<4)
#define OTG_HS_DIEPINT3_TOC                 (0x1U<<3)
#define OTG_HS_DIEPINT3_EPDISD              (0x1U<<1)
#define OTG_HS_DIEPINT3_XFRC                (0x1U<<0)

// DIEPTSIZ3 Configuration

#define OTG_HS_DIEPTSIZ3_MCNT               (0x3U<<29)
#define OTG_HS_DIEPTSIZ3_MCNT_0             (0x1U<<29)
#define OTG_HS_DIEPTSIZ3_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DIEPTSIZ3_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DIEPTSIZ3_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DIEPTSIZ3_XFRSIZ_0           (0x1U<<0)

// DIEPDMA3 Configuration

#define OTG_HS_DIEPDMA3_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DIEPDMA3_DMAADDR_0           (0x1U<<0)

// DTXFSTS3 Configuration

