Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
#define OTG_HS_DTXFSTS3_INEPTFSAV           (0xFFFFU<<0)
#define OTG_HS_DTXFSTS3_INEPTFSAV_0         (0x1U<<0)

// DIEPCTL4 Configuration

#define OTG_HS_DIEPCTL4_EPENA               (0x1U<<31)
#define OTG_HS_DIEPCTL4_EPDIS               (0x1U<<30)
#define OTG_HS_DIEPCTL4_SODDFRM             (0x1U<<29)
#define OTG_HS_DIEPCTL4_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DIEPCTL4_SNAK                (0x1U<<27)
#define OTG_HS_DIEPCTL4_CNAK                (0x1U<<26)
#define OTG_HS_DIEPCTL4_TXFNUM              (0xFU<<22)
#define OTG_HS_DIEPCTL4_TXFNUM_0            (0x1U<<22)
#define OTG_HS_DIEPCTL4_STALL               (0x1U<<21)
#define OTG_HS_DIEPCTL4_EPTYP               (0x3U<<18)
#define OTG_HS_DIEPCTL4_EPTYP_0             (0x1U<<18)
#define OTG_HS_DIEPCTL4_NAKSTS              (0x1U<<17)
#define OTG_HS_DIEPCTL4_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DIEPCTL4_USBAEP              (0x1U<<15)
#define OTG_HS_DIEPCTL4_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DIEPCTL4_MPSIZ_0             (0x1U<<0)

// DIEPINT4 Configuration

#define OTG_HS_DIEPINT4_NAK                 (0x1U<<13)
#define OTG_HS_DIEPINT4_PKTDRPSTS           (0x1U<<11)
#define OTG_HS_DIEPINT4_TXFE                (0x1U<<7)
#define OTG_HS_DIEPINT4_INEPNE              (0x1U<<6)
#define OTG_HS_DIEPINT4_INEPNM              (0x1U<<5)
#define OTG_HS_DIEPINT4_ITTXFE              (0x1U<<4)
#define OTG_HS_DIEPINT4_TOC                 (0x1U<<3)
#define OTG_HS_DIEPINT4_EPDISD              (0x1U<<1)
#define OTG_HS_DIEPINT4_XFRC                (0x1U<<0)

// DIEPTSIZ4 Configuration

#define OTG_HS_DIEPTSIZ4_MCNT               (0x3U<<29)
#define OTG_HS_DIEPTSIZ4_MCNT_0             (0x1U<<29)
#define OTG_HS_DIEPTSIZ4_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DIEPTSIZ4_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DIEPTSIZ4_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DIEPTSIZ4_XFRSIZ_0           (0x1U<<0)

// DIEPDMA4 Configuration

#define OTG_HS_DIEPDMA4_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DIEPDMA4_DMAADDR_0           (0x1U<<0)

// DTXFSTS4 Configuration

#define OTG_HS_DTXFSTS4_INEPTFSAV           (0xFFFFU<<0)
#define OTG_HS_DTXFSTS4_INEPTFSAV_0         (0x1U<<0)

// DIEPCTL5 Configuration

#define OTG_HS_DIEPCTL5_EPENA               (0x1U<<31)
#define OTG_HS_DIEPCTL5_EPDIS               (0x1U<<30)
#define OTG_HS_DIEPCTL5_SODDFRM             (0x1U<<29)
#define OTG_HS_DIEPCTL5_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DIEPCTL5_SNAK                (0x1U<<27)
#define OTG_HS_DIEPCTL5_CNAK                (0x1U<<26)
#define OTG_HS_DIEPCTL5_TXFNUM              (0xFU<<22)
#define OTG_HS_DIEPCTL5_TXFNUM_0            (0x1U<<22)
#define OTG_HS_DIEPCTL5_STALL               (0x1U<<21)
#define OTG_HS_DIEPCTL5_EPTYP               (0x3U<<18)
#define OTG_HS_DIEPCTL5_EPTYP_0             (0x1U<<18)
#define OTG_HS_DIEPCTL5_NAKSTS              (0x1U<<17)
#define OTG_HS_DIEPCTL5_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DIEPCTL5_USBAEP              (0x1U<<15)
#define OTG_HS_DIEPCTL5_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DIEPCTL5_MPSIZ_0             (0x1U<<0)

// DIEPINT5 Configuration

#define OTG_HS_DIEPINT5_NAK                 (0x1U<<13)
#define OTG_HS_DIEPINT5_PKTDRPSTS           (0x1U<<11)
#define OTG_HS_DIEPINT5_TXFE                (0x1U<<7)
#define OTG_HS_DIEPINT5_INEPNE              (0x1U<<6)
#define OTG_HS_DIEPINT5_INEPNM              (0x1U<<5)
#define OTG_HS_DIEPINT5_ITTXFE              (0x1U<<4)
#define OTG_HS_DIEPINT5_TOC                 (0x1U<<3)
#define OTG_HS_DIEPINT5_EPDISD              (0x1U<<1)
#define OTG_HS_DIEPINT5_XFRC                (0x1U<<0)

// DIEPTSIZ5 Configuration

#define OTG_HS_DIEPTSIZ5_MCNT               (0x3U<<29)
#define OTG_HS_DIEPTSIZ5_MCNT_0             (0x1U<<29)
#define OTG_HS_DIEPTSIZ5_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DIEPTSIZ5_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DIEPTSIZ5_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DIEPTSIZ5_XFRSIZ_0           (0x1U<<0)

// DIEPDMA5 Configuration

#define OTG_HS_DIEPDMA5_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DIEPDMA5_DMAADDR_0           (0x1U<<0)

// DTXFSTS5 Configuration

#define OTG_HS_DTXFSTS5_INEPTFSAV           (0xFFFFU<<0)
#define OTG_HS_DTXFSTS5_INEPTFSAV_0         (0x1U<<0)

// DIEPINT6 Configuration

#define OTG_HS_DIEPINT6_NAK                 (0x1U<<13)
#define OTG_HS_DIEPINT6_PKTDRPSTS           (0x1U<<11)
#define OTG_HS_DIEPINT6_BNA                 (0x1U<<9)
#define OTG_HS_DIEPINT6_TXFIFOUDRN          (0x1U<<8)
#define OTG_HS_DIEPINT6_TXFE                (0x1U<<7)
#define OTG_HS_DIEPINT6_INEPNE              (0x1U<<6)
#define OTG_HS_DIEPINT6_INEPNM              (0x1U<<5)
#define OTG_HS_DIEPINT6_ITTXFE              (0x1U<<4)
#define OTG_HS_DIEPINT6_TOC                 (0x1U<<3)
#define OTG_HS_DIEPINT6_AHBERR              (0x1U<<2)
#define OTG_HS_DIEPINT6_EPDISD              (0x1U<<1)
#define OTG_HS_DIEPINT6_XFRC                (0x1U<<0)

// DIEPTSIZ6 Configuration

#define OTG_HS_DIEPTSIZ6_MCNT               (0x3U<<29)
#define OTG_HS_DIEPTSIZ6_MCNT_0             (0x1U<<29)
#define OTG_HS_DIEPTSIZ6_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DIEPTSIZ6_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DIEPTSIZ6_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DIEPTSIZ6_XFRSIZ_0           (0x1U<<0)

// DIEPDMA6 Configuration

#define OTG_HS_DIEPDMA6_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DIEPDMA6_DMAADDR_0           (0x1U<<0)

// DIEPINT7 Configuration

#define OTG_HS_DIEPINT7_NAK                 (0x1U<<13)
#define OTG_HS_DIEPINT7_PKTDRPSTS           (0x1U<<11)
#define OTG_HS_DIEPINT7_BNA                 (0x1U<<9)
#define OTG_HS_DIEPINT7_TXFIFOUDRN          (0x1U<<8)
#define OTG_HS_DIEPINT7_TXFE                (0x1U<<7)
#define OTG_HS_DIEPINT7_INEPNE              (0x1U<<6)
#define OTG_HS_DIEPINT7_INEPNM              (0x1U<<5)
#define OTG_HS_DIEPINT7_ITTXFE              (0x1U<<4)
#define OTG_HS_DIEPINT7_TOC                 (0x1U<<3)
#define OTG_HS_DIEPINT7_AHBERR              (0x1U<<2)
#define OTG_HS_DIEPINT7_EPDISD              (0x1U<<1)
#define OTG_HS_DIEPINT7_XFRC                (0x1U<<0)

// DIEPTSIZ7 Configuration

#define OTG_HS_DIEPTSIZ7_MCNT               (0x3U<<29)
#define OTG_HS_DIEPTSIZ7_MCNT_0             (0x1U<<29)
#define OTG_HS_DIEPTSIZ7_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DIEPTSIZ7_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DIEPTSIZ7_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DIEPTSIZ7_XFRSIZ_0           (0x1U<<0)

// DIEPDMA7 Configuration

#define OTG_HS_DIEPDMA7_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DIEPDMA7_DMAADDR_0           (0x1U<<0)

