Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
// DOEPTSIZ2 Configuration

#define OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT     (0x3U<<29)
#define OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_0   (0x1U<<29)
#define OTG_HS_DOEPTSIZ2_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DOEPTSIZ2_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DOEPTSIZ2_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DOEPTSIZ2_XFRSIZ_0           (0x1U<<0)

// DOEPDMA2 Configuration

#define OTG_HS_DOEPDMA2_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DOEPDMA2_DMAADDR_0           (0x1U<<0)

// DOEPCTL3 Configuration

#define OTG_HS_DOEPCTL3_EPENA               (0x1U<<31)
#define OTG_HS_DOEPCTL3_EPDIS               (0x1U<<30)
#define OTG_HS_DOEPCTL3_SD1PID_SODDFRM      (0x1U<<29)
#define OTG_HS_DOEPCTL3_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DOEPCTL3_SNAK                (0x1U<<27)
#define OTG_HS_DOEPCTL3_CNAK                (0x1U<<26)
#define OTG_HS_DOEPCTL3_STALL               (0x1U<<21)
#define OTG_HS_DOEPCTL3_SNPM                (0x1U<<20)
#define OTG_HS_DOEPCTL3_EPTYP               (0x3U<<18)
#define OTG_HS_DOEPCTL3_EPTYP_0             (0x1U<<18)
#define OTG_HS_DOEPCTL3_NAKSTS              (0x1U<<17)
#define OTG_HS_DOEPCTL3_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DOEPCTL3_USBAEP              (0x1U<<15)
#define OTG_HS_DOEPCTL3_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DOEPCTL3_MPSIZ_0             (0x1U<<0)

// DOEPINT3 Configuration

#define OTG_HS_DOEPINT3_STPKTRX             (0x1U<<15)
#define OTG_HS_DOEPINT3_NYET                (0x1U<<14)
#define OTG_HS_DOEPINT3_NAK                 (0x1U<<13)
#define OTG_HS_DOEPINT3_BERR                (0x1U<<12)
#define OTG_HS_DOEPINT3_BNA                 (0x1U<<9)
#define OTG_HS_DOEPINT3_OUTPKTERR           (0x1U<<8)
#define OTG_HS_DOEPINT3_B2BSTUP             (0x1U<<6)
#define OTG_HS_DOEPINT3_STSPHSRX            (0x1U<<5)
#define OTG_HS_DOEPINT3_OTEPDIS             (0x1U<<4)
#define OTG_HS_DOEPINT3_STUP                (0x1U<<3)
#define OTG_HS_DOEPINT3_AHBERR              (0x1U<<2)
#define OTG_HS_DOEPINT3_EPDISD              (0x1U<<1)
#define OTG_HS_DOEPINT3_XFRC                (0x1U<<0)

// DOEPTSIZ3 Configuration

#define OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT     (0x3U<<29)
#define OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_0   (0x1U<<29)
#define OTG_HS_DOEPTSIZ3_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DOEPTSIZ3_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DOEPTSIZ3_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DOEPTSIZ3_XFRSIZ_0           (0x1U<<0)

// DOEPDMA3 Configuration

#define OTG_HS_DOEPDMA3_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DOEPDMA3_DMAADDR_0           (0x1U<<0)

// DOEPCTL4 Configuration

#define OTG_HS_DOEPCTL4_EPENA               (0x1U<<31)
#define OTG_HS_DOEPCTL4_EPDIS               (0x1U<<30)
#define OTG_HS_DOEPCTL4_SD1PID_SODDFRM      (0x1U<<29)
#define OTG_HS_DOEPCTL4_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DOEPCTL4_SNAK                (0x1U<<27)
#define OTG_HS_DOEPCTL4_CNAK                (0x1U<<26)
#define OTG_HS_DOEPCTL4_STALL               (0x1U<<21)
#define OTG_HS_DOEPCTL4_SNPM                (0x1U<<20)
#define OTG_HS_DOEPCTL4_EPTYP               (0x3U<<18)
#define OTG_HS_DOEPCTL4_EPTYP_0             (0x1U<<18)
#define OTG_HS_DOEPCTL4_NAKSTS              (0x1U<<17)
#define OTG_HS_DOEPCTL4_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DOEPCTL4_USBAEP              (0x1U<<15)
#define OTG_HS_DOEPCTL4_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DOEPCTL4_MPSIZ_0             (0x1U<<0)

// DOEPINT4 Configuration

#define OTG_HS_DOEPINT4_STPKTRX             (0x1U<<15)
#define OTG_HS_DOEPINT4_NYET                (0x1U<<14)
#define OTG_HS_DOEPINT4_NAK                 (0x1U<<13)
#define OTG_HS_DOEPINT4_BERR                (0x1U<<12)
#define OTG_HS_DOEPINT4_BNA                 (0x1U<<9)
#define OTG_HS_DOEPINT4_OUTPKTERR           (0x1U<<8)
#define OTG_HS_DOEPINT4_B2BSTUP             (0x1U<<6)
#define OTG_HS_DOEPINT4_STSPHSRX            (0x1U<<5)
#define OTG_HS_DOEPINT4_OTEPDIS             (0x1U<<4)
#define OTG_HS_DOEPINT4_STUP                (0x1U<<3)
#define OTG_HS_DOEPINT4_AHBERR              (0x1U<<2)
#define OTG_HS_DOEPINT4_EPDISD              (0x1U<<1)
#define OTG_HS_DOEPINT4_XFRC                (0x1U<<0)

// DOEPTSIZ4 Configuration

#define OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT     (0x3U<<29)
#define OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_0   (0x1U<<29)
#define OTG_HS_DOEPTSIZ4_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DOEPTSIZ4_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DOEPTSIZ4_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DOEPTSIZ4_XFRSIZ_0           (0x1U<<0)

// DOEPDMA4 Configuration

#define OTG_HS_DOEPDMA4_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DOEPDMA4_DMAADDR_0           (0x1U<<0)

// DOEPCTL5 Configuration

#define OTG_HS_DOEPCTL5_EPENA               (0x1U<<31)
#define OTG_HS_DOEPCTL5_EPDIS               (0x1U<<30)
#define OTG_HS_DOEPCTL5_SD1PID_SODDFRM      (0x1U<<29)
#define OTG_HS_DOEPCTL5_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DOEPCTL5_SNAK                (0x1U<<27)
#define OTG_HS_DOEPCTL5_CNAK                (0x1U<<26)
#define OTG_HS_DOEPCTL5_STALL               (0x1U<<21)
#define OTG_HS_DOEPCTL5_SNPM                (0x1U<<20)
#define OTG_HS_DOEPCTL5_EPTYP               (0x3U<<18)
#define OTG_HS_DOEPCTL5_EPTYP_0             (0x1U<<18)
#define OTG_HS_DOEPCTL5_NAKSTS              (0x1U<<17)
#define OTG_HS_DOEPCTL5_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DOEPCTL5_USBAEP              (0x1U<<15)
#define OTG_HS_DOEPCTL5_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DOEPCTL5_MPSIZ_0             (0x1U<<0)

// DOEPINT5 Configuration

#define OTG_HS_DOEPINT5_STPKTRX             (0x1U<<15)
#define OTG_HS_DOEPINT5_NYET                (0x1U<<14)
#define OTG_HS_DOEPINT5_NAK                 (0x1U<<13)
#define OTG_HS_DOEPINT5_BERR                (0x1U<<12)
#define OTG_HS_DOEPINT5_BNA                 (0x1U<<9)
#define OTG_HS_DOEPINT5_OUTPKTERR           (0x1U<<8)
#define OTG_HS_DOEPINT5_B2BSTUP             (0x1U<<6)
#define OTG_HS_DOEPINT5_STSPHSRX            (0x1U<<5)
#define OTG_HS_DOEPINT5_OTEPDIS             (0x1U<<4)
#define OTG_HS_DOEPINT5_STUP                (0x1U<<3)
#define OTG_HS_DOEPINT5_AHBERR              (0x1U<<2)
#define OTG_HS_DOEPINT5_EPDISD              (0x1U<<1)
#define OTG_HS_DOEPINT5_XFRC                (0x1U<<0)

// DOEPTSIZ5 Configuration

#define OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT     (0x3U<<29)
#define OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT_0   (0x1U<<29)
#define OTG_HS_DOEPTSIZ5_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DOEPTSIZ5_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DOEPTSIZ5_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DOEPTSIZ5_XFRSIZ_0           (0x1U<<0)

// DOEPDMA5 Configuration

#define OTG_HS_DOEPDMA5_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DOEPDMA5_DMAADDR_0           (0x1U<<0)

// DOEPCTL6 Configuration

#define OTG_HS_DOEPCTL6_EPENA               (0x1U<<31)
#define OTG_HS_DOEPCTL6_EPDIS               (0x1U<<30)
#define OTG_HS_DOEPCTL6_SD1PID_SODDFRM      (0x1U<<29)
#define OTG_HS_DOEPCTL6_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DOEPCTL6_SNAK                (0x1U<<27)
#define OTG_HS_DOEPCTL6_CNAK                (0x1U<<26)
#define OTG_HS_DOEPCTL6_STALL               (0x1U<<21)
#define OTG_HS_DOEPCTL6_SNPM                (0x1U<<20)
#define OTG_HS_DOEPCTL6_EPTYP               (0x3U<<18)
#define OTG_HS_DOEPCTL6_EPTYP_0             (0x1U<<18)
#define OTG_HS_DOEPCTL6_NAKSTS              (0x1U<<17)
#define OTG_HS_DOEPCTL6_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DOEPCTL6_USBAEP              (0x1U<<15)
#define OTG_HS_DOEPCTL6_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DOEPCTL6_MPSIZ_0             (0x1U<<0)

// DOEPINT6 Configuration

