Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_otg_hs.h
#define OTG_HS_DOEPINT6_STPKTRX             (0x1U<<15)
#define OTG_HS_DOEPINT6_NYET                (0x1U<<14)
#define OTG_HS_DOEPINT6_NAK                 (0x1U<<13)
#define OTG_HS_DOEPINT6_BERR                (0x1U<<12)
#define OTG_HS_DOEPINT6_BNA                 (0x1U<<9)
#define OTG_HS_DOEPINT6_OUTPKTERR           (0x1U<<8)
#define OTG_HS_DOEPINT6_B2BSTUP             (0x1U<<6)
#define OTG_HS_DOEPINT6_STSPHSRX            (0x1U<<5)
#define OTG_HS_DOEPINT6_OTEPDIS             (0x1U<<4)
#define OTG_HS_DOEPINT6_STUP                (0x1U<<3)
#define OTG_HS_DOEPINT6_AHBERR              (0x1U<<2)
#define OTG_HS_DOEPINT6_EPDISD              (0x1U<<1)
#define OTG_HS_DOEPINT6_XFRC                (0x1U<<0)

// DOEPTSIZ6 Configuration

#define OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT     (0x3U<<29)
#define OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT_0   (0x1U<<29)
#define OTG_HS_DOEPTSIZ6_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DOEPTSIZ6_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DOEPTSIZ6_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DOEPTSIZ6_XFRSIZ_0           (0x1U<<0)

// DOEPDMA6 Configuration

#define OTG_HS_DOEPDMA6_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DOEPDMA6_DMAADDR_0           (0x1U<<0)

// DOEPCTL7 Configuration

#define OTG_HS_DOEPCTL7_EPENA               (0x1U<<31)
#define OTG_HS_DOEPCTL7_EPDIS               (0x1U<<30)
#define OTG_HS_DOEPCTL7_SD1PID_SODDFRM      (0x1U<<29)
#define OTG_HS_DOEPCTL7_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DOEPCTL7_SNAK                (0x1U<<27)
#define OTG_HS_DOEPCTL7_CNAK                (0x1U<<26)
#define OTG_HS_DOEPCTL7_STALL               (0x1U<<21)
#define OTG_HS_DOEPCTL7_SNPM                (0x1U<<20)
#define OTG_HS_DOEPCTL7_EPTYP               (0x3U<<18)
#define OTG_HS_DOEPCTL7_EPTYP_0             (0x1U<<18)
#define OTG_HS_DOEPCTL7_NAKSTS              (0x1U<<17)
#define OTG_HS_DOEPCTL7_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DOEPCTL7_USBAEP              (0x1U<<15)
#define OTG_HS_DOEPCTL7_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DOEPCTL7_MPSIZ_0             (0x1U<<0)

// DOEPINT7 Configuration

#define OTG_HS_DOEPINT7_STPKTRX             (0x1U<<15)
#define OTG_HS_DOEPINT7_NYET                (0x1U<<14)
#define OTG_HS_DOEPINT7_NAK                 (0x1U<<13)
#define OTG_HS_DOEPINT7_BERR                (0x1U<<12)
#define OTG_HS_DOEPINT7_BNA                 (0x1U<<9)
#define OTG_HS_DOEPINT7_OUTPKTERR           (0x1U<<8)
#define OTG_HS_DOEPINT7_B2BSTUP             (0x1U<<6)
#define OTG_HS_DOEPINT7_STSPHSRX            (0x1U<<5)
#define OTG_HS_DOEPINT7_OTEPDIS             (0x1U<<4)
#define OTG_HS_DOEPINT7_STUP                (0x1U<<3)
#define OTG_HS_DOEPINT7_AHBERR              (0x1U<<2)
#define OTG_HS_DOEPINT7_EPDISD              (0x1U<<1)
#define OTG_HS_DOEPINT7_XFRC                (0x1U<<0)

// DOEPTSIZ7 Configuration

#define OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT     (0x3U<<29)
#define OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT_0   (0x1U<<29)
#define OTG_HS_DOEPTSIZ7_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DOEPTSIZ7_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DOEPTSIZ7_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DOEPTSIZ7_XFRSIZ_0           (0x1U<<0)

// DOEPDMA7 Configuration

#define OTG_HS_DOEPDMA7_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DOEPDMA7_DMAADDR_0           (0x1U<<0)

// DOEPCTL8 Configuration

#define OTG_HS_DOEPCTL8_EPENA               (0x1U<<31)
#define OTG_HS_DOEPCTL8_EPDIS               (0x1U<<30)
#define OTG_HS_DOEPCTL8_SD1PID_SODDFRM      (0x1U<<29)
#define OTG_HS_DOEPCTL8_SD0PID_SEVNFRM      (0x1U<<28)
#define OTG_HS_DOEPCTL8_SNAK                (0x1U<<27)
#define OTG_HS_DOEPCTL8_CNAK                (0x1U<<26)
#define OTG_HS_DOEPCTL8_STALL               (0x1U<<21)
#define OTG_HS_DOEPCTL8_SNPM                (0x1U<<20)
#define OTG_HS_DOEPCTL8_EPTYP               (0x3U<<18)
#define OTG_HS_DOEPCTL8_EPTYP_0             (0x1U<<18)
#define OTG_HS_DOEPCTL8_NAKSTS              (0x1U<<17)
#define OTG_HS_DOEPCTL8_EONUM_DPIP          (0x1U<<16)
#define OTG_HS_DOEPCTL8_USBAEP              (0x1U<<15)
#define OTG_HS_DOEPCTL8_MPSIZ               (0x7FFU<<0)
#define OTG_HS_DOEPCTL8_MPSIZ_0             (0x1U<<0)

// DOEPINT8 Configuration

#define OTG_HS_DOEPINT8_STPKTRX             (0x1U<<15)
#define OTG_HS_DOEPINT8_NYET                (0x1U<<14)
#define OTG_HS_DOEPINT8_NAK                 (0x1U<<13)
#define OTG_HS_DOEPINT8_BERR                (0x1U<<12)
#define OTG_HS_DOEPINT8_BNA                 (0x1U<<9)
#define OTG_HS_DOEPINT8_OUTPKTERR           (0x1U<<8)
#define OTG_HS_DOEPINT8_B2BSTUP             (0x1U<<6)
#define OTG_HS_DOEPINT8_STSPHSRX            (0x1U<<5)
#define OTG_HS_DOEPINT8_OTEPDIS             (0x1U<<4)
#define OTG_HS_DOEPINT8_STUP                (0x1U<<3)
#define OTG_HS_DOEPINT8_AHBERR              (0x1U<<2)
#define OTG_HS_DOEPINT8_EPDISD              (0x1U<<1)
#define OTG_HS_DOEPINT8_XFRC                (0x1U<<0)

// DOEPTSIZ8 Configuration

#define OTG_HS_DOEPTSIZ8_RXDPID_STUPCNT     (0x3U<<29)
#define OTG_HS_DOEPTSIZ8_RXDPID_STUPCNT_0   (0x1U<<29)
#define OTG_HS_DOEPTSIZ8_PKTCNT             (0x3FFU<<19)
#define OTG_HS_DOEPTSIZ8_PKTCNT_0           (0x1U<<19)
#define OTG_HS_DOEPTSIZ8_XFRSIZ             (0x7FFFFU<<0)
#define OTG_HS_DOEPTSIZ8_XFRSIZ_0           (0x1U<<0)

// DOEPDMA8 Configuration

#define OTG_HS_DOEPDMA8_DMAADDR             (0xFFFFFFFFU<<0)
#define OTG_HS_DOEPDMA8_DMAADDR_0           (0x1U<<0)

// PCGCCTL Configuration

#define OTG_HS_PCGCCTL_SUSP                 (0x1U<<7)
#define OTG_HS_PCGCCTL_PHYSLEEP             (0x1U<<6)
#define OTG_HS_PCGCCTL_ENL1GTG              (0x1U<<5)
#define OTG_HS_PCGCCTL_PHYSUSP              (0x1U<<4)
#define OTG_HS_PCGCCTL_GATEHCLK             (0x1U<<1)
#define OTG_HS_PCGCCTL_STPPCLK              (0x1U<<0)
